program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.4"}, {"coremlc-version", "1839.0.0"}, {"coremltools-component-torch", "2.0.1+cu117"}, {"coremltools-version", "7.0b1"}})]
{
    func main<ios16>(tensor<fp16, [1, 3, 1024, 1024]> z) {
            tensor<int32, []> var_15 = const()[name = tensor<string, []>("op_15"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_33 = const()[name = tensor<string, []>("op_33"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_35 = const()[name = tensor<string, []>("op_35"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 3, 3, 3]> encoder_conv_in_weight_to_fp16 = const()[name = tensor<string, []>("encoder_conv_in_weight_to_fp16"), val = tensor<fp16, [128, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [128]> encoder_conv_in_bias_to_fp16 = const()[name = tensor<string, []>("encoder_conv_in_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7040)))];
            tensor<fp16, [1, 128, 1024, 1024]> input_1_cast = conv(bias = encoder_conv_in_bias_to_fp16, dilations = var_35, groups = var_15, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = var_33, weight = encoder_conv_in_weight_to_fp16, x = z)[name = tensor<string, []>("input_1_cast")];
            tensor<int32, [5]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [5]>([1, 32, 4, 1024, 1024])];
            tensor<fp16, [1, 32, 4, 1024, 1024]> reshape_0_cast = reshape(shape = reshape_0_shape_0, x = input_1_cast)[name = tensor<string, []>("reshape_0_cast")];
            tensor<int32, [3]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_0_cast = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0_cast)[name = tensor<string, []>("reduce_mean_0_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> sub_0_cast = sub(x = reshape_0_cast, y = reduce_mean_0_cast)[name = tensor<string, []>("sub_0_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> square_0_cast = square(x = sub_0_cast)[name = tensor<string, []>("square_0_cast")];
            tensor<int32, [3]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_2_cast = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0_cast)[name = tensor<string, []>("reduce_mean_2_cast")];
            tensor<fp16, []> add_0_y_0_to_fp16 = const()[name = tensor<string, []>("add_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_0_cast = add(x = reduce_mean_2_cast, y = add_0_y_0_to_fp16)[name = tensor<string, []>("add_0_cast")];
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_0_cast = sqrt(x = add_0_cast)[name = tensor<string, []>("sqrt_0_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> real_div_0_cast = real_div(x = sub_0_cast, y = sqrt_0_cast)[name = tensor<string, []>("real_div_0_cast")];
            tensor<int32, [4]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [4]>([1, 128, 1024, 1024])];
            tensor<fp16, [1, 128, 1024, 1024]> reshape_1_cast = reshape(shape = reshape_1_shape_0, x = real_div_0_cast)[name = tensor<string, []>("reshape_1_cast")];
            tensor<fp16, [128]> add_1_mean_0_to_fp16 = const()[name = tensor<string, []>("add_1_mean_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7360)))];
            tensor<fp16, [128]> add_1_variance_0_to_fp16 = const()[name = tensor<string, []>("add_1_variance_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7680)))];
            tensor<fp16, [128]> add_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_1_gamma_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8000)))];
            tensor<fp16, [128]> add_1_beta_0_to_fp16 = const()[name = tensor<string, []>("add_1_beta_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8320)))];
            tensor<fp16, []> add_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 128, 1024, 1024]> add_1_cast = batch_norm(beta = add_1_beta_0_to_fp16, epsilon = add_1_epsilon_0_to_fp16, gamma = add_1_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_1_cast)[name = tensor<string, []>("add_1_cast")];
            tensor<fp16, [1, 128, 1024, 1024]> input_5_cast = silu(x = add_1_cast)[name = tensor<string, []>("input_5_cast")];
            tensor<int32, [2]> var_54 = const()[name = tensor<string, []>("op_54"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_56 = const()[name = tensor<string, []>("op_56"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> encoder_down_blocks_0_resnets_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_0_resnets_0_conv1_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8640)))];
            tensor<fp16, [128]> encoder_down_blocks_0_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_0_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(303616)))];
            tensor<fp16, [1, 128, 1024, 1024]> input_7_cast = conv(bias = encoder_down_blocks_0_resnets_0_conv1_bias_to_fp16, dilations = var_56, groups = var_15, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = var_54, weight = encoder_down_blocks_0_resnets_0_conv1_weight_to_fp16, x = input_5_cast)[name = tensor<string, []>("input_7_cast")];
            tensor<int32, [5]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [5]>([1, 32, 4, 1024, 1024])];
            tensor<fp16, [1, 32, 4, 1024, 1024]> reshape_4_cast = reshape(shape = reshape_4_shape_0, x = input_7_cast)[name = tensor<string, []>("reshape_4_cast")];
            tensor<int32, [3]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_3_cast = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_4_cast)[name = tensor<string, []>("reduce_mean_3_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> sub_2_cast = sub(x = reshape_4_cast, y = reduce_mean_3_cast)[name = tensor<string, []>("sub_2_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> square_1_cast = square(x = sub_2_cast)[name = tensor<string, []>("square_1_cast")];
            tensor<int32, [3]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_5_cast = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1_cast)[name = tensor<string, []>("reduce_mean_5_cast")];
            tensor<fp16, []> add_2_y_0_to_fp16 = const()[name = tensor<string, []>("add_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_2_cast = add(x = reduce_mean_5_cast, y = add_2_y_0_to_fp16)[name = tensor<string, []>("add_2_cast")];
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_1_cast = sqrt(x = add_2_cast)[name = tensor<string, []>("sqrt_1_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> real_div_1_cast = real_div(x = sub_2_cast, y = sqrt_1_cast)[name = tensor<string, []>("real_div_1_cast")];
            tensor<int32, [4]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [4]>([1, 128, 1024, 1024])];
            tensor<fp16, [1, 128, 1024, 1024]> reshape_5_cast = reshape(shape = reshape_5_shape_0, x = real_div_1_cast)[name = tensor<string, []>("reshape_5_cast")];
            tensor<fp16, [128]> add_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_3_gamma_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(303936)))];
            tensor<fp16, [128]> add_3_beta_0_to_fp16 = const()[name = tensor<string, []>("add_3_beta_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(304256)))];
            tensor<fp16, []> add_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 128, 1024, 1024]> add_3_cast = batch_norm(beta = add_3_beta_0_to_fp16, epsilon = add_3_epsilon_0_to_fp16, gamma = add_3_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_5_cast)[name = tensor<string, []>("add_3_cast")];
            tensor<fp16, [1, 128, 1024, 1024]> input_11_cast = silu(x = add_3_cast)[name = tensor<string, []>("input_11_cast")];
            tensor<int32, [2]> var_66 = const()[name = tensor<string, []>("op_66"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_68 = const()[name = tensor<string, []>("op_68"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_1_pad_type_0 = const()[name = tensor<string, []>("hidden_states_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_1_pad_0 = const()[name = tensor<string, []>("hidden_states_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> encoder_down_blocks_0_resnets_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_0_resnets_0_conv2_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(304576)))];
            tensor<fp16, [128]> encoder_down_blocks_0_resnets_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_0_resnets_0_conv2_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(599552)))];
            tensor<fp16, [1, 128, 1024, 1024]> hidden_states_1_cast = conv(bias = encoder_down_blocks_0_resnets_0_conv2_bias_to_fp16, dilations = var_68, groups = var_15, pad = hidden_states_1_pad_0, pad_type = hidden_states_1_pad_type_0, strides = var_66, weight = encoder_down_blocks_0_resnets_0_conv2_weight_to_fp16, x = input_11_cast)[name = tensor<string, []>("hidden_states_1_cast")];
            tensor<fp16, [1, 128, 1024, 1024]> var_71_cast = add(x = input_1_cast, y = hidden_states_1_cast)[name = tensor<string, []>("op_71_cast")];
            tensor<int32, [5]> reshape_8_shape_0 = const()[name = tensor<string, []>("reshape_8_shape_0"), val = tensor<int32, [5]>([1, 32, 4, 1024, 1024])];
            tensor<fp16, [1, 32, 4, 1024, 1024]> reshape_8_cast = reshape(shape = reshape_8_shape_0, x = var_71_cast)[name = tensor<string, []>("reshape_8_cast")];
            tensor<int32, [3]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_6_cast = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_8_cast)[name = tensor<string, []>("reduce_mean_6_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> sub_4_cast = sub(x = reshape_8_cast, y = reduce_mean_6_cast)[name = tensor<string, []>("sub_4_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> square_2_cast = square(x = sub_4_cast)[name = tensor<string, []>("square_2_cast")];
            tensor<int32, [3]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_8_cast = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2_cast)[name = tensor<string, []>("reduce_mean_8_cast")];
            tensor<fp16, []> add_4_y_0_to_fp16 = const()[name = tensor<string, []>("add_4_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_4_cast = add(x = reduce_mean_8_cast, y = add_4_y_0_to_fp16)[name = tensor<string, []>("add_4_cast")];
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_2_cast = sqrt(x = add_4_cast)[name = tensor<string, []>("sqrt_2_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> real_div_2_cast = real_div(x = sub_4_cast, y = sqrt_2_cast)[name = tensor<string, []>("real_div_2_cast")];
            tensor<int32, [4]> reshape_9_shape_0 = const()[name = tensor<string, []>("reshape_9_shape_0"), val = tensor<int32, [4]>([1, 128, 1024, 1024])];
            tensor<fp16, [1, 128, 1024, 1024]> reshape_9_cast = reshape(shape = reshape_9_shape_0, x = real_div_2_cast)[name = tensor<string, []>("reshape_9_cast")];
            tensor<fp16, [128]> add_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_5_gamma_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(599872)))];
            tensor<fp16, [128]> add_5_beta_0_to_fp16 = const()[name = tensor<string, []>("add_5_beta_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(600192)))];
            tensor<fp16, []> add_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 128, 1024, 1024]> add_5_cast = batch_norm(beta = add_5_beta_0_to_fp16, epsilon = add_5_epsilon_0_to_fp16, gamma = add_5_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_9_cast)[name = tensor<string, []>("add_5_cast")];
            tensor<fp16, [1, 128, 1024, 1024]> input_19_cast = silu(x = add_5_cast)[name = tensor<string, []>("input_19_cast")];
            tensor<int32, [2]> var_84 = const()[name = tensor<string, []>("op_84"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_86 = const()[name = tensor<string, []>("op_86"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> encoder_down_blocks_0_resnets_1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_0_resnets_1_conv1_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(600512)))];
            tensor<fp16, [128]> encoder_down_blocks_0_resnets_1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_0_resnets_1_conv1_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(895488)))];
            tensor<fp16, [1, 128, 1024, 1024]> input_21_cast = conv(bias = encoder_down_blocks_0_resnets_1_conv1_bias_to_fp16, dilations = var_86, groups = var_15, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = var_84, weight = encoder_down_blocks_0_resnets_1_conv1_weight_to_fp16, x = input_19_cast)[name = tensor<string, []>("input_21_cast")];
            tensor<int32, [5]> reshape_12_shape_0 = const()[name = tensor<string, []>("reshape_12_shape_0"), val = tensor<int32, [5]>([1, 32, 4, 1024, 1024])];
            tensor<fp16, [1, 32, 4, 1024, 1024]> reshape_12_cast = reshape(shape = reshape_12_shape_0, x = input_21_cast)[name = tensor<string, []>("reshape_12_cast")];
            tensor<int32, [3]> reduce_mean_9_axes_0 = const()[name = tensor<string, []>("reduce_mean_9_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_9_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_9_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_9_cast = reduce_mean(axes = reduce_mean_9_axes_0, keep_dims = reduce_mean_9_keep_dims_0, x = reshape_12_cast)[name = tensor<string, []>("reduce_mean_9_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> sub_6_cast = sub(x = reshape_12_cast, y = reduce_mean_9_cast)[name = tensor<string, []>("sub_6_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> square_3_cast = square(x = sub_6_cast)[name = tensor<string, []>("square_3_cast")];
            tensor<int32, [3]> reduce_mean_11_axes_0 = const()[name = tensor<string, []>("reduce_mean_11_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_11_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_11_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_11_cast = reduce_mean(axes = reduce_mean_11_axes_0, keep_dims = reduce_mean_11_keep_dims_0, x = square_3_cast)[name = tensor<string, []>("reduce_mean_11_cast")];
            tensor<fp16, []> add_6_y_0_to_fp16 = const()[name = tensor<string, []>("add_6_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_6_cast = add(x = reduce_mean_11_cast, y = add_6_y_0_to_fp16)[name = tensor<string, []>("add_6_cast")];
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_3_cast = sqrt(x = add_6_cast)[name = tensor<string, []>("sqrt_3_cast")];
            tensor<fp16, [1, 32, 4, 1024, 1024]> real_div_3_cast = real_div(x = sub_6_cast, y = sqrt_3_cast)[name = tensor<string, []>("real_div_3_cast")];
            tensor<int32, [4]> reshape_13_shape_0 = const()[name = tensor<string, []>("reshape_13_shape_0"), val = tensor<int32, [4]>([1, 128, 1024, 1024])];
            tensor<fp16, [1, 128, 1024, 1024]> reshape_13_cast = reshape(shape = reshape_13_shape_0, x = real_div_3_cast)[name = tensor<string, []>("reshape_13_cast")];
            tensor<fp16, [128]> add_7_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_7_gamma_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(895808)))];
            tensor<fp16, [128]> add_7_beta_0_to_fp16 = const()[name = tensor<string, []>("add_7_beta_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(896128)))];
            tensor<fp16, []> add_7_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_7_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 128, 1024, 1024]> add_7_cast = batch_norm(beta = add_7_beta_0_to_fp16, epsilon = add_7_epsilon_0_to_fp16, gamma = add_7_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_13_cast)[name = tensor<string, []>("add_7_cast")];
            tensor<fp16, [1, 128, 1024, 1024]> input_25_cast = silu(x = add_7_cast)[name = tensor<string, []>("input_25_cast")];
            tensor<int32, [2]> var_96 = const()[name = tensor<string, []>("op_96"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_98 = const()[name = tensor<string, []>("op_98"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_3_pad_type_0 = const()[name = tensor<string, []>("hidden_states_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_3_pad_0 = const()[name = tensor<string, []>("hidden_states_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> encoder_down_blocks_0_resnets_1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_0_resnets_1_conv2_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(896448)))];
            tensor<fp16, [128]> encoder_down_blocks_0_resnets_1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_0_resnets_1_conv2_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1191424)))];
            tensor<fp16, [1, 128, 1024, 1024]> hidden_states_3_cast = conv(bias = encoder_down_blocks_0_resnets_1_conv2_bias_to_fp16, dilations = var_98, groups = var_15, pad = hidden_states_3_pad_0, pad_type = hidden_states_3_pad_type_0, strides = var_96, weight = encoder_down_blocks_0_resnets_1_conv2_weight_to_fp16, x = input_25_cast)[name = tensor<string, []>("hidden_states_3_cast")];
            tensor<fp16, [1, 128, 1024, 1024]> var_101_cast = add(x = var_71_cast, y = hidden_states_3_cast)[name = tensor<string, []>("op_101_cast")];
            tensor<int32, [8]> hidden_states_7_pad_0 = const()[name = tensor<string, []>("hidden_states_7_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<string, []> hidden_states_7_mode_0 = const()[name = tensor<string, []>("hidden_states_7_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> hidden_states_7_constant_val_0_to_fp16 = const()[name = tensor<string, []>("hidden_states_7_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 128, 1025, 1025]> hidden_states_7_cast = pad(constant_val = hidden_states_7_constant_val_0_to_fp16, mode = hidden_states_7_mode_0, pad = hidden_states_7_pad_0, x = var_101_cast)[name = tensor<string, []>("hidden_states_7_cast")];
            tensor<int32, [2]> var_109 = const()[name = tensor<string, []>("op_109"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_111 = const()[name = tensor<string, []>("op_111"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 128, 3, 3]> encoder_down_blocks_0_downsamplers_0_conv_weight_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_0_downsamplers_0_conv_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1191744)))];
            tensor<fp16, [128]> encoder_down_blocks_0_downsamplers_0_conv_bias_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_0_downsamplers_0_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1486720)))];
            tensor<fp16, [1, 128, 512, 512]> input_29_cast = conv(bias = encoder_down_blocks_0_downsamplers_0_conv_bias_to_fp16, dilations = var_111, groups = var_15, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = var_109, weight = encoder_down_blocks_0_downsamplers_0_conv_weight_to_fp16, x = hidden_states_7_cast)[name = tensor<string, []>("input_29_cast")];
            tensor<int32, [5]> reshape_16_shape_0 = const()[name = tensor<string, []>("reshape_16_shape_0"), val = tensor<int32, [5]>([1, 32, 4, 512, 512])];
            tensor<fp16, [1, 32, 4, 512, 512]> reshape_16_cast = reshape(shape = reshape_16_shape_0, x = input_29_cast)[name = tensor<string, []>("reshape_16_cast")];
            tensor<int32, [3]> reduce_mean_12_axes_0 = const()[name = tensor<string, []>("reduce_mean_12_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_12_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_12_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_12_cast = reduce_mean(axes = reduce_mean_12_axes_0, keep_dims = reduce_mean_12_keep_dims_0, x = reshape_16_cast)[name = tensor<string, []>("reduce_mean_12_cast")];
            tensor<fp16, [1, 32, 4, 512, 512]> sub_8_cast = sub(x = reshape_16_cast, y = reduce_mean_12_cast)[name = tensor<string, []>("sub_8_cast")];
            tensor<fp16, [1, 32, 4, 512, 512]> square_4_cast = square(x = sub_8_cast)[name = tensor<string, []>("square_4_cast")];
            tensor<int32, [3]> reduce_mean_14_axes_0 = const()[name = tensor<string, []>("reduce_mean_14_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_14_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_14_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_14_cast = reduce_mean(axes = reduce_mean_14_axes_0, keep_dims = reduce_mean_14_keep_dims_0, x = square_4_cast)[name = tensor<string, []>("reduce_mean_14_cast")];
            tensor<fp16, []> add_8_y_0_to_fp16 = const()[name = tensor<string, []>("add_8_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_8_cast = add(x = reduce_mean_14_cast, y = add_8_y_0_to_fp16)[name = tensor<string, []>("add_8_cast")];
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_4_cast = sqrt(x = add_8_cast)[name = tensor<string, []>("sqrt_4_cast")];
            tensor<fp16, [1, 32, 4, 512, 512]> real_div_4_cast = real_div(x = sub_8_cast, y = sqrt_4_cast)[name = tensor<string, []>("real_div_4_cast")];
            tensor<int32, [4]> reshape_17_shape_0 = const()[name = tensor<string, []>("reshape_17_shape_0"), val = tensor<int32, [4]>([1, 128, 512, 512])];
            tensor<fp16, [1, 128, 512, 512]> reshape_17_cast = reshape(shape = reshape_17_shape_0, x = real_div_4_cast)[name = tensor<string, []>("reshape_17_cast")];
            tensor<fp16, [128]> add_9_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_9_gamma_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1487040)))];
            tensor<fp16, [128]> add_9_beta_0_to_fp16 = const()[name = tensor<string, []>("add_9_beta_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1487360)))];
            tensor<fp16, []> add_9_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_9_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 128, 512, 512]> add_9_cast = batch_norm(beta = add_9_beta_0_to_fp16, epsilon = add_9_epsilon_0_to_fp16, gamma = add_9_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_17_cast)[name = tensor<string, []>("add_9_cast")];
            tensor<fp16, [1, 128, 512, 512]> input_33_cast = silu(x = add_9_cast)[name = tensor<string, []>("input_33_cast")];
            tensor<int32, [2]> var_131 = const()[name = tensor<string, []>("op_131"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_133 = const()[name = tensor<string, []>("op_133"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_35_pad_type_0 = const()[name = tensor<string, []>("input_35_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_35_pad_0 = const()[name = tensor<string, []>("input_35_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [256, 128, 3, 3]> encoder_down_blocks_1_resnets_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_1_resnets_0_conv1_weight_to_fp16"), val = tensor<fp16, [256, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1487680)))];
            tensor<fp16, [256]> encoder_down_blocks_1_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_1_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2077568)))];
            tensor<fp16, [1, 256, 512, 512]> input_35_cast = conv(bias = encoder_down_blocks_1_resnets_0_conv1_bias_to_fp16, dilations = var_133, groups = var_15, pad = input_35_pad_0, pad_type = input_35_pad_type_0, strides = var_131, weight = encoder_down_blocks_1_resnets_0_conv1_weight_to_fp16, x = input_33_cast)[name = tensor<string, []>("input_35_cast")];
            tensor<int32, [5]> reshape_20_shape_0 = const()[name = tensor<string, []>("reshape_20_shape_0"), val = tensor<int32, [5]>([1, 32, 8, 512, 512])];
            tensor<fp16, [1, 32, 8, 512, 512]> reshape_20_cast = reshape(shape = reshape_20_shape_0, x = input_35_cast)[name = tensor<string, []>("reshape_20_cast")];
            tensor<int32, [3]> reduce_mean_15_axes_0 = const()[name = tensor<string, []>("reduce_mean_15_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_15_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_15_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_15_cast = reduce_mean(axes = reduce_mean_15_axes_0, keep_dims = reduce_mean_15_keep_dims_0, x = reshape_20_cast)[name = tensor<string, []>("reduce_mean_15_cast")];
            tensor<fp16, [1, 32, 8, 512, 512]> sub_10_cast = sub(x = reshape_20_cast, y = reduce_mean_15_cast)[name = tensor<string, []>("sub_10_cast")];
            tensor<fp16, [1, 32, 8, 512, 512]> square_5_cast = square(x = sub_10_cast)[name = tensor<string, []>("square_5_cast")];
            tensor<int32, [3]> reduce_mean_17_axes_0 = const()[name = tensor<string, []>("reduce_mean_17_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_17_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_17_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_17_cast = reduce_mean(axes = reduce_mean_17_axes_0, keep_dims = reduce_mean_17_keep_dims_0, x = square_5_cast)[name = tensor<string, []>("reduce_mean_17_cast")];
            tensor<fp16, []> add_10_y_0_to_fp16 = const()[name = tensor<string, []>("add_10_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_10_cast = add(x = reduce_mean_17_cast, y = add_10_y_0_to_fp16)[name = tensor<string, []>("add_10_cast")];
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_5_cast = sqrt(x = add_10_cast)[name = tensor<string, []>("sqrt_5_cast")];
            tensor<fp16, [1, 32, 8, 512, 512]> real_div_5_cast = real_div(x = sub_10_cast, y = sqrt_5_cast)[name = tensor<string, []>("real_div_5_cast")];
            tensor<int32, [4]> reshape_21_shape_0 = const()[name = tensor<string, []>("reshape_21_shape_0"), val = tensor<int32, [4]>([1, 256, 512, 512])];
            tensor<fp16, [1, 256, 512, 512]> reshape_21_cast = reshape(shape = reshape_21_shape_0, x = real_div_5_cast)[name = tensor<string, []>("reshape_21_cast")];
            tensor<fp16, [256]> add_11_mean_0_to_fp16 = const()[name = tensor<string, []>("add_11_mean_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2078144)))];
            tensor<fp16, [256]> add_11_variance_0_to_fp16 = const()[name = tensor<string, []>("add_11_variance_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2078720)))];
            tensor<fp16, [256]> add_11_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_11_gamma_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2079296)))];
            tensor<fp16, [256]> add_11_beta_0_to_fp16 = const()[name = tensor<string, []>("add_11_beta_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2079872)))];
            tensor<fp16, []> add_11_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_11_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 256, 512, 512]> add_11_cast = batch_norm(beta = add_11_beta_0_to_fp16, epsilon = add_11_epsilon_0_to_fp16, gamma = add_11_gamma_0_to_fp16, mean = add_11_mean_0_to_fp16, variance = add_11_variance_0_to_fp16, x = reshape_21_cast)[name = tensor<string, []>("add_11_cast")];
            tensor<fp16, [1, 256, 512, 512]> input_39_cast = silu(x = add_11_cast)[name = tensor<string, []>("input_39_cast")];
            tensor<int32, [2]> var_143 = const()[name = tensor<string, []>("op_143"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_145 = const()[name = tensor<string, []>("op_145"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_9_pad_type_0 = const()[name = tensor<string, []>("hidden_states_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_9_pad_0 = const()[name = tensor<string, []>("hidden_states_9_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [256, 256, 3, 3]> encoder_down_blocks_1_resnets_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_1_resnets_0_conv2_weight_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2080448)))];
            tensor<fp16, [256]> encoder_down_blocks_1_resnets_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_1_resnets_0_conv2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3260160)))];
            tensor<fp16, [1, 256, 512, 512]> hidden_states_9_cast = conv(bias = encoder_down_blocks_1_resnets_0_conv2_bias_to_fp16, dilations = var_145, groups = var_15, pad = hidden_states_9_pad_0, pad_type = hidden_states_9_pad_type_0, strides = var_143, weight = encoder_down_blocks_1_resnets_0_conv2_weight_to_fp16, x = input_39_cast)[name = tensor<string, []>("hidden_states_9_cast")];
            tensor<int32, [2]> var_150 = const()[name = tensor<string, []>("op_150"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_152 = const()[name = tensor<string, []>("op_152"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_tensor_1_pad_type_0 = const()[name = tensor<string, []>("input_tensor_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_tensor_1_pad_0 = const()[name = tensor<string, []>("input_tensor_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 128, 1, 1]> encoder_down_blocks_1_resnets_0_conv_shortcut_weight_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_1_resnets_0_conv_shortcut_weight_to_fp16"), val = tensor<fp16, [256, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3260736)))];
            tensor<fp16, [256]> encoder_down_blocks_1_resnets_0_conv_shortcut_bias_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_1_resnets_0_conv_shortcut_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3326336)))];
            tensor<fp16, [1, 256, 512, 512]> input_tensor_1_cast = conv(bias = encoder_down_blocks_1_resnets_0_conv_shortcut_bias_to_fp16, dilations = var_152, groups = var_15, pad = input_tensor_1_pad_0, pad_type = input_tensor_1_pad_type_0, strides = var_150, weight = encoder_down_blocks_1_resnets_0_conv_shortcut_weight_to_fp16, x = input_29_cast)[name = tensor<string, []>("input_tensor_1_cast")];
            tensor<fp16, [1, 256, 512, 512]> var_155_cast = add(x = input_tensor_1_cast, y = hidden_states_9_cast)[name = tensor<string, []>("op_155_cast")];
            tensor<int32, [5]> reshape_24_shape_0 = const()[name = tensor<string, []>("reshape_24_shape_0"), val = tensor<int32, [5]>([1, 32, 8, 512, 512])];
            tensor<fp16, [1, 32, 8, 512, 512]> reshape_24_cast = reshape(shape = reshape_24_shape_0, x = var_155_cast)[name = tensor<string, []>("reshape_24_cast")];
            tensor<int32, [3]> reduce_mean_18_axes_0 = const()[name = tensor<string, []>("reduce_mean_18_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_18_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_18_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_18_cast = reduce_mean(axes = reduce_mean_18_axes_0, keep_dims = reduce_mean_18_keep_dims_0, x = reshape_24_cast)[name = tensor<string, []>("reduce_mean_18_cast")];
            tensor<fp16, [1, 32, 8, 512, 512]> sub_12_cast = sub(x = reshape_24_cast, y = reduce_mean_18_cast)[name = tensor<string, []>("sub_12_cast")];
            tensor<fp16, [1, 32, 8, 512, 512]> square_6_cast = square(x = sub_12_cast)[name = tensor<string, []>("square_6_cast")];
            tensor<int32, [3]> reduce_mean_20_axes_0 = const()[name = tensor<string, []>("reduce_mean_20_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_20_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_20_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_20_cast = reduce_mean(axes = reduce_mean_20_axes_0, keep_dims = reduce_mean_20_keep_dims_0, x = square_6_cast)[name = tensor<string, []>("reduce_mean_20_cast")];
            tensor<fp16, []> add_12_y_0_to_fp16 = const()[name = tensor<string, []>("add_12_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_12_cast = add(x = reduce_mean_20_cast, y = add_12_y_0_to_fp16)[name = tensor<string, []>("add_12_cast")];
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_6_cast = sqrt(x = add_12_cast)[name = tensor<string, []>("sqrt_6_cast")];
            tensor<fp16, [1, 32, 8, 512, 512]> real_div_6_cast = real_div(x = sub_12_cast, y = sqrt_6_cast)[name = tensor<string, []>("real_div_6_cast")];
            tensor<int32, [4]> reshape_25_shape_0 = const()[name = tensor<string, []>("reshape_25_shape_0"), val = tensor<int32, [4]>([1, 256, 512, 512])];
            tensor<fp16, [1, 256, 512, 512]> reshape_25_cast = reshape(shape = reshape_25_shape_0, x = real_div_6_cast)[name = tensor<string, []>("reshape_25_cast")];
            tensor<fp16, [256]> add_13_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_13_gamma_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3326912)))];
            tensor<fp16, [256]> add_13_beta_0_to_fp16 = const()[name = tensor<string, []>("add_13_beta_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3327488)))];
            tensor<fp16, []> add_13_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_13_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 256, 512, 512]> add_13_cast = batch_norm(beta = add_13_beta_0_to_fp16, epsilon = add_13_epsilon_0_to_fp16, gamma = add_13_gamma_0_to_fp16, mean = add_11_mean_0_to_fp16, variance = add_11_variance_0_to_fp16, x = reshape_25_cast)[name = tensor<string, []>("add_13_cast")];
            tensor<fp16, [1, 256, 512, 512]> input_47_cast = silu(x = add_13_cast)[name = tensor<string, []>("input_47_cast")];
            tensor<int32, [2]> var_168 = const()[name = tensor<string, []>("op_168"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_170 = const()[name = tensor<string, []>("op_170"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_49_pad_type_0 = const()[name = tensor<string, []>("input_49_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_49_pad_0 = const()[name = tensor<string, []>("input_49_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [256, 256, 3, 3]> encoder_down_blocks_1_resnets_1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_1_resnets_1_conv1_weight_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3328064)))];
            tensor<fp16, [256]> encoder_down_blocks_1_resnets_1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_1_resnets_1_conv1_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4507776)))];
            tensor<fp16, [1, 256, 512, 512]> input_49_cast = conv(bias = encoder_down_blocks_1_resnets_1_conv1_bias_to_fp16, dilations = var_170, groups = var_15, pad = input_49_pad_0, pad_type = input_49_pad_type_0, strides = var_168, weight = encoder_down_blocks_1_resnets_1_conv1_weight_to_fp16, x = input_47_cast)[name = tensor<string, []>("input_49_cast")];
            tensor<int32, [5]> reshape_28_shape_0 = const()[name = tensor<string, []>("reshape_28_shape_0"), val = tensor<int32, [5]>([1, 32, 8, 512, 512])];
            tensor<fp16, [1, 32, 8, 512, 512]> reshape_28_cast = reshape(shape = reshape_28_shape_0, x = input_49_cast)[name = tensor<string, []>("reshape_28_cast")];
            tensor<int32, [3]> reduce_mean_21_axes_0 = const()[name = tensor<string, []>("reduce_mean_21_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_21_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_21_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_21_cast = reduce_mean(axes = reduce_mean_21_axes_0, keep_dims = reduce_mean_21_keep_dims_0, x = reshape_28_cast)[name = tensor<string, []>("reduce_mean_21_cast")];
            tensor<fp16, [1, 32, 8, 512, 512]> sub_14_cast = sub(x = reshape_28_cast, y = reduce_mean_21_cast)[name = tensor<string, []>("sub_14_cast")];
            tensor<fp16, [1, 32, 8, 512, 512]> square_7_cast = square(x = sub_14_cast)[name = tensor<string, []>("square_7_cast")];
            tensor<int32, [3]> reduce_mean_23_axes_0 = const()[name = tensor<string, []>("reduce_mean_23_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_23_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_23_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 32, 1, 1, 1]> reduce_mean_23_cast = reduce_mean(axes = reduce_mean_23_axes_0, keep_dims = reduce_mean_23_keep_dims_0, x = square_7_cast)[name = tensor<string, []>("reduce_mean_23_cast")];
            tensor<fp16, []> add_14_y_0_to_fp16 = const()[name = tensor<string, []>("add_14_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 32, 1, 1, 1]> add_14_cast = add(x = reduce_mean_23_cast, y = add_14_y_0_to_fp16)[name = tensor<string, []>("add_14_cast")];
            tensor<fp16, [1, 32, 1, 1, 1]> sqrt_7_cast = sqrt(x = add_14_cast)[name = tensor<string, []>("sqrt_7_cast")];
            tensor<fp16, [1, 32, 8, 512, 512]> real_div_7_cast = real_div(x = sub_14_cast, y = sqrt_7_cast)[name = tensor<string, []>("real_div_7_cast")];
            tensor<int32, [4]> reshape_29_shape_0 = const()[name = tensor<string, []>("reshape_29_shape_0"), val = tensor<int32, [4]>([1, 256, 512, 512])];
            tensor<fp16, [1, 256, 512, 512]> reshape_29_cast = reshape(shape = reshape_29_shape_0, x = real_div_7_cast)[name = tensor<string, []>("reshape_29_cast")];
            tensor<fp16, [256]> add_15_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_15_gamma_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4508352)))];
            tensor<fp16, [256]> add_15_beta_0_to_fp16 = const()[name = tensor<string, []>("add_15_beta_0_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4508928)))];
            tensor<fp16, []> add_15_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_15_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 256, 512, 512]> add_15_cast = batch_norm(beta = add_15_beta_0_to_fp16, epsilon = add_15_epsilon_0_to_fp16, gamma = add_15_gamma_0_to_fp16, mean = add_11_mean_0_to_fp16, variance = add_11_variance_0_to_fp16, x = reshape_29_cast)[name = tensor<string, []>("add_15_cast")];
            tensor<fp16, [1, 256, 512, 512]> input_53_cast = silu(x = add_15_cast)[name = tensor<string, []>("input_53_cast")];
            tensor<int32, [2]> var_180 = const()[name = tensor<string, []>("op_180"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_182 = const()[name = tensor<string, []>("op_182"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_11_pad_type_0 = const()[name = tensor<string, []>("hidden_states_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_11_pad_0 = const()[name = tensor<string, []>("hidden_states_11_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [256, 256, 3, 3]> encoder_down_blocks_1_resnets_1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_1_resnets_1_conv2_weight_to_fp16"), val = tensor<fp16, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4509504)))];
            tensor<fp16, [256]> encoder_down_blocks_1_resnets_1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("encoder_down_blocks_1_resnets_1_conv2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5689216)))];
            tensor<fp16, [1, 256, 512, 512]> hidden_states_11_cast = conv(bias = encoder_down_blocks_1_resnets_1_conv2_bias_to_fp16, dilations = var_182, groups = var_15, pad = hidden_states_11_pad_0, pad_type = hidden_states_11_pad_type_0, strides = var_180, weight = encoder_down_blocks_1_resnets_1_conv2_weight_to_fp16, x = input_53_cast)[name = tensor<string, []>("hidden_states_11_cast")];
            tensor<fp16, [1, 256, 512, 512]> var_185_cast = add(x = var_155_cast, y = hidden_states_11_cast)[name = tensor<string, []>("op_185_cast")];
            tensor<int32, [8]> hidden_states_15_pad_0 = const()[name = tensor<string, []>("hidden_states_15_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<string, []> hidden_states_15_mode_0 = const()[name = tensor<string, []>("hidden_states_15_mode_0"), val = tensor<string, []>("constant")];
            tensor<fp16, []> hidden_states_15_constant_val_0_to_fp16 = const()[name = tensor<string, []>("hidden_states_15_constant_val_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 256, 513, 513]> hidden_states_15_cast = pad(constant_val = hidden_states_15_constant_val_0_to_fp16, mode = hidden_states_15_mode_0, pad = hidden_states_15_pad_0, x = var_185_cast)[name = tensor<string, []>("hidden_states_15_cast")];
            tensor<int32, [2]> var_193 = const()[name = tensor<string, []>("op_193"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_195 = const()[name = tensor<string, []>("op_195"), val = tensor<int32, [2]>([1, 1])];
