program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.4"}, {"coremlc-version", "1839.0.0"}, {"coremltools-component-torch", "2.0.1"}, {"coremltools-version", "7.0b1"}})]
{
    func main<ios16>(tensor<fp32, [1, 4, 128, 128]> z) {
            tensor<fp32, [4]> post_quant_conv_bias = const()[name = tensor<string, []>("post_quant_conv_bias"), val = tensor<fp32, [4]>([-0x1.dbcp-5, 0x1.cf4p-3, -0x1.c7cp-4, 0x1.adp-3])];
            tensor<fp32, [4, 4, 1, 1]> post_quant_conv_weight = const()[name = tensor<string, []>("post_quant_conv_weight"), val = tensor<fp32, [4, 4, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp32, [512]> decoder_conv_in_bias = const()[name = tensor<string, []>("decoder_conv_in_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192)))];
            tensor<fp32, [512, 4, 3, 3]> decoder_conv_in_weight = const()[name = tensor<string, []>("decoder_conv_in_weight"), val = tensor<fp32, [512, 4, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2304)))];
            tensor<fp32, [512]> decoder_mid_block_resnets_0_conv1_bias = const()[name = tensor<string, []>("decoder_mid_block_resnets_0_conv1_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(76096)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_mid_block_resnets_0_conv1_weight = const()[name = tensor<string, []>("decoder_mid_block_resnets_0_conv1_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(78208)))];
            tensor<fp32, [512]> decoder_mid_block_resnets_0_conv2_bias = const()[name = tensor<string, []>("decoder_mid_block_resnets_0_conv2_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9515456)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_mid_block_resnets_0_conv2_weight = const()[name = tensor<string, []>("decoder_mid_block_resnets_0_conv2_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9517568)))];
            tensor<fp32, [512]> decoder_mid_block_attentions_0_to_q_bias = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_to_q_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18954816)))];
            tensor<fp32, [512, 512]> decoder_mid_block_attentions_0_to_q_weight = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_to_q_weight"), val = tensor<fp32, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18956928)))];
            tensor<fp32, [512]> decoder_mid_block_attentions_0_to_k_bias = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_to_k_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20005568)))];
            tensor<fp32, [512, 512]> decoder_mid_block_attentions_0_to_k_weight = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_to_k_weight"), val = tensor<fp32, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20007680)))];
            tensor<fp32, [512]> decoder_mid_block_attentions_0_to_v_bias = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_to_v_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21056320)))];
            tensor<fp32, [512, 512]> decoder_mid_block_attentions_0_to_v_weight = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_to_v_weight"), val = tensor<fp32, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21058432)))];
            tensor<fp32, [512]> decoder_mid_block_attentions_0_to_out_0_bias = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_to_out_0_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22107072)))];
            tensor<fp32, [512, 512]> decoder_mid_block_attentions_0_to_out_0_weight = const()[name = tensor<string, []>("decoder_mid_block_attentions_0_to_out_0_weight"), val = tensor<fp32, [512, 512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22109184)))];
            tensor<fp32, [512]> decoder_mid_block_resnets_1_conv1_bias = const()[name = tensor<string, []>("decoder_mid_block_resnets_1_conv1_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23157824)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_mid_block_resnets_1_conv1_weight = const()[name = tensor<string, []>("decoder_mid_block_resnets_1_conv1_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23159936)))];
            tensor<fp32, [512]> decoder_mid_block_resnets_1_conv2_bias = const()[name = tensor<string, []>("decoder_mid_block_resnets_1_conv2_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32597184)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_mid_block_resnets_1_conv2_weight = const()[name = tensor<string, []>("decoder_mid_block_resnets_1_conv2_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32599296)))];
            tensor<fp32, [512]> decoder_up_blocks_0_resnets_0_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_0_conv1_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42036544)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_0_resnets_0_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_0_conv1_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42038656)))];
            tensor<fp32, [512]> decoder_up_blocks_0_resnets_0_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_0_conv2_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51475904)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_0_resnets_0_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_0_conv2_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51478016)))];
            tensor<fp32, [512]> decoder_up_blocks_0_resnets_1_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_1_conv1_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60915264)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_0_resnets_1_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_1_conv1_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60917376)))];
            tensor<fp32, [512]> decoder_up_blocks_0_resnets_1_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_1_conv2_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(70354624)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_0_resnets_1_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_1_conv2_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(70356736)))];
            tensor<fp32, [512]> decoder_up_blocks_0_resnets_2_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_2_conv1_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79793984)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_0_resnets_2_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_2_conv1_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79796096)))];
            tensor<fp32, [512]> decoder_up_blocks_0_resnets_2_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_2_conv2_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(89233344)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_0_resnets_2_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_0_resnets_2_conv2_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(89235456)))];
            tensor<fp32, [512]> decoder_up_blocks_0_upsamplers_0_conv_bias = const()[name = tensor<string, []>("decoder_up_blocks_0_upsamplers_0_conv_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(98672704)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_0_upsamplers_0_conv_weight = const()[name = tensor<string, []>("decoder_up_blocks_0_upsamplers_0_conv_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(98674816)))];
            tensor<fp32, [512]> decoder_up_blocks_1_resnets_0_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_0_conv1_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(108112064)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_1_resnets_0_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_0_conv1_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(108114176)))];
            tensor<fp32, [512]> decoder_up_blocks_1_resnets_0_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_0_conv2_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117551424)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_1_resnets_0_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_0_conv2_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117553536)))];
            tensor<fp32, [512]> decoder_up_blocks_1_resnets_1_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_1_conv1_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126990784)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_1_resnets_1_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_1_conv1_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126992896)))];
            tensor<fp32, [512]> decoder_up_blocks_1_resnets_1_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_1_conv2_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136430144)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_1_resnets_1_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_1_conv2_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136432256)))];
            tensor<fp32, [512]> decoder_up_blocks_1_resnets_2_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_2_conv1_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145869504)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_1_resnets_2_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_2_conv1_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145871616)))];
            tensor<fp32, [512]> decoder_up_blocks_1_resnets_2_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_2_conv2_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(155308864)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_1_resnets_2_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_1_resnets_2_conv2_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(155310976)))];
            tensor<fp32, [512]> decoder_up_blocks_1_upsamplers_0_conv_bias = const()[name = tensor<string, []>("decoder_up_blocks_1_upsamplers_0_conv_bias"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(164748224)))];
            tensor<fp32, [512, 512, 3, 3]> decoder_up_blocks_1_upsamplers_0_conv_weight = const()[name = tensor<string, []>("decoder_up_blocks_1_upsamplers_0_conv_weight"), val = tensor<fp32, [512, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(164750336)))];
            tensor<fp32, [256]> decoder_up_blocks_2_resnets_0_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_0_conv1_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(174187584)))];
            tensor<fp32, [256, 512, 3, 3]> decoder_up_blocks_2_resnets_0_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_0_conv1_weight"), val = tensor<fp32, [256, 512, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(174188672)))];
            tensor<fp32, [256]> decoder_up_blocks_2_resnets_0_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_0_conv2_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(178907328)))];
            tensor<fp32, [256, 256, 3, 3]> decoder_up_blocks_2_resnets_0_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_0_conv2_weight"), val = tensor<fp32, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(178908416)))];
            tensor<fp32, [256]> decoder_up_blocks_2_resnets_0_conv_shortcut_bias = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_0_conv_shortcut_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(181267776)))];
            tensor<fp32, [256, 512, 1, 1]> decoder_up_blocks_2_resnets_0_conv_shortcut_weight = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_0_conv_shortcut_weight"), val = tensor<fp32, [256, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(181268864)))];
            tensor<fp32, [256]> decoder_up_blocks_2_resnets_1_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_1_conv1_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(181793216)))];
            tensor<fp32, [256, 256, 3, 3]> decoder_up_blocks_2_resnets_1_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_1_conv1_weight"), val = tensor<fp32, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(181794304)))];
            tensor<fp32, [256]> decoder_up_blocks_2_resnets_1_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_1_conv2_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(184153664)))];
            tensor<fp32, [256, 256, 3, 3]> decoder_up_blocks_2_resnets_1_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_1_conv2_weight"), val = tensor<fp32, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(184154752)))];
            tensor<fp32, [256]> decoder_up_blocks_2_resnets_2_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_2_conv1_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(186514112)))];
            tensor<fp32, [256, 256, 3, 3]> decoder_up_blocks_2_resnets_2_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_2_conv1_weight"), val = tensor<fp32, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(186515200)))];
            tensor<fp32, [256]> decoder_up_blocks_2_resnets_2_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_2_conv2_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(188874560)))];
            tensor<fp32, [256, 256, 3, 3]> decoder_up_blocks_2_resnets_2_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_2_resnets_2_conv2_weight"), val = tensor<fp32, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(188875648)))];
            tensor<fp32, [256]> decoder_up_blocks_2_upsamplers_0_conv_bias = const()[name = tensor<string, []>("decoder_up_blocks_2_upsamplers_0_conv_bias"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(191235008)))];
            tensor<fp32, [256, 256, 3, 3]> decoder_up_blocks_2_upsamplers_0_conv_weight = const()[name = tensor<string, []>("decoder_up_blocks_2_upsamplers_0_conv_weight"), val = tensor<fp32, [256, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(191236096)))];
            tensor<fp32, [128]> decoder_up_blocks_3_resnets_0_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_0_conv1_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193595456)))];
            tensor<fp32, [128, 256, 3, 3]> decoder_up_blocks_3_resnets_0_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_0_conv1_weight"), val = tensor<fp32, [128, 256, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193596032)))];
            tensor<fp32, [128]> decoder_up_blocks_3_resnets_0_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_0_conv2_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(194775744)))];
            tensor<fp32, [128, 128, 3, 3]> decoder_up_blocks_3_resnets_0_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_0_conv2_weight"), val = tensor<fp32, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(194776320)))];
            tensor<fp32, [128]> decoder_up_blocks_3_resnets_0_conv_shortcut_bias = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_0_conv_shortcut_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(195366208)))];
            tensor<fp32, [128, 256, 1, 1]> decoder_up_blocks_3_resnets_0_conv_shortcut_weight = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_0_conv_shortcut_weight"), val = tensor<fp32, [128, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(195366784)))];
            tensor<fp32, [128]> decoder_up_blocks_3_resnets_1_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_1_conv1_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(195497920)))];
            tensor<fp32, [128, 128, 3, 3]> decoder_up_blocks_3_resnets_1_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_1_conv1_weight"), val = tensor<fp32, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(195498496)))];
            tensor<fp32, [128]> decoder_up_blocks_3_resnets_1_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_1_conv2_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196088384)))];
            tensor<fp32, [128, 128, 3, 3]> decoder_up_blocks_3_resnets_1_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_1_conv2_weight"), val = tensor<fp32, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196088960)))];
            tensor<fp32, [128]> decoder_up_blocks_3_resnets_2_conv1_bias = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_2_conv1_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196678848)))];
            tensor<fp32, [128, 128, 3, 3]> decoder_up_blocks_3_resnets_2_conv1_weight = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_2_conv1_weight"), val = tensor<fp32, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(196679424)))];
            tensor<fp32, [128]> decoder_up_blocks_3_resnets_2_conv2_bias = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_2_conv2_bias"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197269312)))];
            tensor<fp32, [128, 128, 3, 3]> decoder_up_blocks_3_resnets_2_conv2_weight = const()[name = tensor<string, []>("decoder_up_blocks_3_resnets_2_conv2_weight"), val = tensor<fp32, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197269888)))];
            tensor<fp32, [3]> decoder_conv_out_bias = const()[name = tensor<string, []>("decoder_conv_out_bias"), val = tensor<fp32, [3]>([0x1.fd4p-4, 0x1.4c8p-4, 0x1.93p-5])];
            tensor<fp32, [3, 128, 3, 3]> decoder_conv_out_weight = const()[name = tensor<string, []>("decoder_conv_out_weight"), val = tensor<fp32, [3, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197859776)))];
            tensor<int32, []> var_7 = const()[name = tensor<string, []>("op_7"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_10 = const()[name = tensor<string, []>("op_10"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_12 = const()[name = tensor<string, []>("op_12"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp32, [1, 4, 128, 128]> input_1 = conv(bias = post_quant_conv_bias, dilations = var_12, groups = var_7, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = var_10, weight = post_quant_conv_weight, x = z)[name = tensor<string, []>("input_1")];
            tensor<int32, []> var_26 = const()[name = tensor<string, []>("op_26"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_44 = const()[name = tensor<string, []>("op_44"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_46 = const()[name = tensor<string, []>("op_46"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp32, [1, 512, 128, 128]> input_3 = conv(bias = decoder_conv_in_bias, dilations = var_46, groups = var_26, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = var_44, weight = decoder_conv_in_weight, x = input_1)[name = tensor<string, []>("input_3")];
            tensor<int32, [5]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 128, 128])];
            tensor<fp32, [1, 32, 16, 128, 128]> reshape_0 = reshape(shape = reshape_0_shape_0, x = input_3)[name = tensor<string, []>("reshape_0")];
            tensor<int32, [3]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 32, 1, 1, 1]> reduce_mean_0 = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0)[name = tensor<string, []>("reduce_mean_0")];
            tensor<fp32, [1, 32, 16, 128, 128]> sub_0 = sub(x = reshape_0, y = reduce_mean_0)[name = tensor<string, []>("sub_0")];
            tensor<fp32, [1, 32, 16, 128, 128]> square_0 = square(x = sub_0)[name = tensor<string, []>("square_0")];
            tensor<int32, [3]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 32, 1, 1, 1]> reduce_mean_2 = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0)[name = tensor<string, []>("reduce_mean_2")];
            tensor<fp32, []> add_0_y_0 = const()[name = tensor<string, []>("add_0_y_0"), val = tensor<fp32, []>(0x1.0c6f7ap-20)];
            tensor<fp32, [1, 32, 1, 1, 1]> add_0 = add(x = reduce_mean_2, y = add_0_y_0)[name = tensor<string, []>("add_0")];
            tensor<fp32, [1, 32, 1, 1, 1]> sqrt_0 = sqrt(x = add_0)[name = tensor<string, []>("sqrt_0")];
            tensor<fp32, [1, 32, 16, 128, 128]> real_div_0 = real_div(x = sub_0, y = sqrt_0)[name = tensor<string, []>("real_div_0")];
            tensor<int32, [4]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [4]>([1, 512, 128, 128])];
            tensor<fp32, [1, 512, 128, 128]> reshape_1 = reshape(shape = reshape_1_shape_0, x = real_div_0)[name = tensor<string, []>("reshape_1")];
            tensor<fp32, [512]> add_1_mean_0 = const()[name = tensor<string, []>("add_1_mean_0"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197873664)))];
            tensor<fp32, [512]> add_1_variance_0 = const()[name = tensor<string, []>("add_1_variance_0"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197875776)))];
            tensor<fp32, [512]> add_1_gamma_0 = const()[name = tensor<string, []>("add_1_gamma_0"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197877888)))];
            tensor<fp32, [512]> add_1_beta_0 = const()[name = tensor<string, []>("add_1_beta_0"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197880000)))];
            tensor<fp32, []> add_1_epsilon_0 = const()[name = tensor<string, []>("add_1_epsilon_0"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [1, 512, 128, 128]> add_1 = batch_norm(beta = add_1_beta_0, epsilon = add_1_epsilon_0, gamma = add_1_gamma_0, mean = add_1_mean_0, variance = add_1_variance_0, x = reshape_1)[name = tensor<string, []>("add_1")];
            tensor<fp32, [1, 512, 128, 128]> input_7 = silu(x = add_1)[name = tensor<string, []>("input_7")];
            tensor<int32, [2]> var_65 = const()[name = tensor<string, []>("op_65"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_67 = const()[name = tensor<string, []>("op_67"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp32, [1, 512, 128, 128]> input_9 = conv(bias = decoder_mid_block_resnets_0_conv1_bias, dilations = var_67, groups = var_26, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_65, weight = decoder_mid_block_resnets_0_conv1_weight, x = input_7)[name = tensor<string, []>("input_9")];
            tensor<int32, [5]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 128, 128])];
            tensor<fp32, [1, 32, 16, 128, 128]> reshape_4 = reshape(shape = reshape_4_shape_0, x = input_9)[name = tensor<string, []>("reshape_4")];
            tensor<int32, [3]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 32, 1, 1, 1]> reduce_mean_3 = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_4)[name = tensor<string, []>("reduce_mean_3")];
            tensor<fp32, [1, 32, 16, 128, 128]> sub_2 = sub(x = reshape_4, y = reduce_mean_3)[name = tensor<string, []>("sub_2")];
            tensor<fp32, [1, 32, 16, 128, 128]> square_1 = square(x = sub_2)[name = tensor<string, []>("square_1")];
            tensor<int32, [3]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 32, 1, 1, 1]> reduce_mean_5 = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1)[name = tensor<string, []>("reduce_mean_5")];
            tensor<fp32, []> add_2_y_0 = const()[name = tensor<string, []>("add_2_y_0"), val = tensor<fp32, []>(0x1.0c6f7ap-20)];
            tensor<fp32, [1, 32, 1, 1, 1]> add_2 = add(x = reduce_mean_5, y = add_2_y_0)[name = tensor<string, []>("add_2")];
            tensor<fp32, [1, 32, 1, 1, 1]> sqrt_1 = sqrt(x = add_2)[name = tensor<string, []>("sqrt_1")];
            tensor<fp32, [1, 32, 16, 128, 128]> real_div_1 = real_div(x = sub_2, y = sqrt_1)[name = tensor<string, []>("real_div_1")];
            tensor<int32, [4]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [4]>([1, 512, 128, 128])];
            tensor<fp32, [1, 512, 128, 128]> reshape_5 = reshape(shape = reshape_5_shape_0, x = real_div_1)[name = tensor<string, []>("reshape_5")];
            tensor<fp32, [512]> add_3_gamma_0 = const()[name = tensor<string, []>("add_3_gamma_0"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197882112)))];
            tensor<fp32, [512]> add_3_beta_0 = const()[name = tensor<string, []>("add_3_beta_0"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197884224)))];
            tensor<fp32, []> add_3_epsilon_0 = const()[name = tensor<string, []>("add_3_epsilon_0"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [1, 512, 128, 128]> add_3 = batch_norm(beta = add_3_beta_0, epsilon = add_3_epsilon_0, gamma = add_3_gamma_0, mean = add_1_mean_0, variance = add_1_variance_0, x = reshape_5)[name = tensor<string, []>("add_3")];
            tensor<fp32, [1, 512, 128, 128]> input_13 = silu(x = add_3)[name = tensor<string, []>("input_13")];
            tensor<int32, [2]> var_77 = const()[name = tensor<string, []>("op_77"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_79 = const()[name = tensor<string, []>("op_79"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_1_pad_type_0 = const()[name = tensor<string, []>("hidden_states_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_1_pad_0 = const()[name = tensor<string, []>("hidden_states_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp32, [1, 512, 128, 128]> hidden_states_1 = conv(bias = decoder_mid_block_resnets_0_conv2_bias, dilations = var_79, groups = var_26, pad = hidden_states_1_pad_0, pad_type = hidden_states_1_pad_type_0, strides = var_77, weight = decoder_mid_block_resnets_0_conv2_weight, x = input_13)[name = tensor<string, []>("hidden_states_1")];
            tensor<fp32, [1, 512, 128, 128]> var_82 = add(x = input_3, y = hidden_states_1)[name = tensor<string, []>("op_82")];
            tensor<int32, [4]> reshape_8_shape_0 = const()[name = tensor<string, []>("reshape_8_shape_0"), val = tensor<int32, [4]>([1, 32, 16, 16384])];
            tensor<fp32, [1, 32, 16, 16384]> reshape_8 = reshape(shape = reshape_8_shape_0, x = var_82)[name = tensor<string, []>("reshape_8")];
            tensor<int32, [2]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 32, 1, 1]> reduce_mean_6 = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_8)[name = tensor<string, []>("reduce_mean_6")];
            tensor<fp32, [1, 32, 16, 16384]> sub_4 = sub(x = reshape_8, y = reduce_mean_6)[name = tensor<string, []>("sub_4")];
            tensor<fp32, [1, 32, 16, 16384]> square_2 = square(x = sub_4)[name = tensor<string, []>("square_2")];
            tensor<int32, [2]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [2]>([2, 3])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 32, 1, 1]> reduce_mean_8 = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2)[name = tensor<string, []>("reduce_mean_8")];
            tensor<fp32, []> add_4_y_0 = const()[name = tensor<string, []>("add_4_y_0"), val = tensor<fp32, []>(0x1.0c6f7ap-20)];
            tensor<fp32, [1, 32, 1, 1]> add_4 = add(x = reduce_mean_8, y = add_4_y_0)[name = tensor<string, []>("add_4")];
            tensor<fp32, [1, 32, 1, 1]> sqrt_2 = sqrt(x = add_4)[name = tensor<string, []>("sqrt_2")];
            tensor<fp32, [1, 32, 16, 16384]> real_div_2 = real_div(x = sub_4, y = sqrt_2)[name = tensor<string, []>("real_div_2")];
            tensor<int32, [3]> reshape_9_shape_0 = const()[name = tensor<string, []>("reshape_9_shape_0"), val = tensor<int32, [3]>([1, 512, 16384])];
            tensor<fp32, [1, 512, 16384]> reshape_9 = reshape(shape = reshape_9_shape_0, x = real_div_2)[name = tensor<string, []>("reshape_9")];
            tensor<fp32, [1, 512, 1]> reshape_10 = const()[name = tensor<string, []>("reshape_10"), val = tensor<fp32, [1, 512, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197886336)))];
            tensor<fp32, [1, 512, 16384]> mul_2 = mul(x = reshape_9, y = reshape_10)[name = tensor<string, []>("mul_2")];
            tensor<fp32, [1, 512, 1]> reshape_11 = const()[name = tensor<string, []>("reshape_11"), val = tensor<fp32, [1, 512, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197888448)))];
            tensor<fp32, [1, 512, 16384]> add_5 = add(x = mul_2, y = reshape_11)[name = tensor<string, []>("add_5")];
            tensor<int32, [3]> input_19_perm_0 = const()[name = tensor<string, []>("input_19_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp32, [1, 16384, 512]> transpose_11 = transpose(perm = input_19_perm_0, x = add_5)[name = tensor<string, []>("transpose_11")];
            tensor<fp32, [1, 16384, 512]> query_1 = linear(bias = decoder_mid_block_attentions_0_to_q_bias, weight = decoder_mid_block_attentions_0_to_q_weight, x = transpose_11)[name = tensor<string, []>("query_1")];
            tensor<fp32, [1, 16384, 512]> key_1 = linear(bias = decoder_mid_block_attentions_0_to_k_bias, weight = decoder_mid_block_attentions_0_to_k_weight, x = transpose_11)[name = tensor<string, []>("key_1")];
            tensor<fp32, [1, 16384, 512]> value_1 = linear(bias = decoder_mid_block_attentions_0_to_v_bias, weight = decoder_mid_block_attentions_0_to_v_weight, x = transpose_11)[name = tensor<string, []>("value_1")];
            tensor<int32, [4]> var_123 = const()[name = tensor<string, []>("op_123"), val = tensor<int32, [4]>([1, -1, 1, 512])];
            tensor<fp32, [1, 16384, 1, 512]> var_124 = reshape(shape = var_123, x = query_1)[name = tensor<string, []>("op_124")];
            tensor<int32, [4]> var_126 = const()[name = tensor<string, []>("op_126"), val = tensor<int32, [4]>([1, -1, 1, 512])];
            tensor<fp32, [1, 16384, 1, 512]> var_127 = reshape(shape = var_126, x = key_1)[name = tensor<string, []>("op_127")];
            tensor<int32, [4]> var_129 = const()[name = tensor<string, []>("op_129"), val = tensor<int32, [4]>([1, -1, 1, 512])];
            tensor<fp32, [1, 16384, 1, 512]> var_130 = reshape(shape = var_129, x = value_1)[name = tensor<string, []>("op_130")];
            tensor<int32, [4]> value_perm_0 = const()[name = tensor<string, []>("value_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp32, []> mul_3_y_0 = const()[name = tensor<string, []>("mul_3_y_0"), val = tensor<fp32, []>(0x1.6a09e6p-5)];
            tensor<fp32, [1, 16384, 1, 512]> mul_3 = mul(x = var_124, y = mul_3_y_0)[name = tensor<string, []>("mul_3")];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_4_perm_0 = const()[name = tensor<string, []>("transpose_4_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> transpose_5_perm_0 = const()[name = tensor<string, []>("transpose_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp32, [1, 1, 16384, 512]> transpose_8 = transpose(perm = transpose_5_perm_0, x = var_127)[name = tensor<string, []>("transpose_8")];
            tensor<fp32, [1, 1, 16384, 512]> transpose_9 = transpose(perm = transpose_4_perm_0, x = mul_3)[name = tensor<string, []>("transpose_9")];
            tensor<fp32, [1, 1, 16384, 16384]> matmul_0 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = transpose_9, y = transpose_8)[name = tensor<string, []>("matmul_0")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp32, [1, 1, 16384, 16384]> softmax_0 = softmax(axis = softmax_0_axis_0, x = matmul_0)[name = tensor<string, []>("softmax_0")];
            tensor<bool, []> hidden_states_7_transpose_x_0 = const()[name = tensor<string, []>("hidden_states_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> hidden_states_7_transpose_y_0 = const()[name = tensor<string, []>("hidden_states_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp32, [1, 1, 16384, 512]> transpose_10 = transpose(perm = value_perm_0, x = var_130)[name = tensor<string, []>("transpose_10")];
            tensor<fp32, [1, 1, 16384, 512]> hidden_states_7 = matmul(transpose_x = hidden_states_7_transpose_x_0, transpose_y = hidden_states_7_transpose_y_0, x = softmax_0, y = transpose_10)[name = tensor<string, []>("hidden_states_7")];
            tensor<int32, [4]> var_133_perm_0 = const()[name = tensor<string, []>("op_133_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_137 = const()[name = tensor<string, []>("op_137"), val = tensor<int32, [3]>([1, -1, 512])];
            tensor<fp32, [1, 16384, 1, 512]> transpose_7 = transpose(perm = var_133_perm_0, x = hidden_states_7)[name = tensor<string, []>("transpose_7")];
            tensor<fp32, [1, 16384, 512]> hidden_states_9 = reshape(shape = var_137, x = transpose_7)[name = tensor<string, []>("hidden_states_9")];
            tensor<fp32, [1, 16384, 512]> input_23 = linear(bias = decoder_mid_block_attentions_0_to_out_0_bias, weight = decoder_mid_block_attentions_0_to_out_0_weight, x = hidden_states_9)[name = tensor<string, []>("input_23")];
            tensor<int32, [3]> var_144_perm_0 = const()[name = tensor<string, []>("op_144_perm_0"), val = tensor<int32, [3]>([0, -1, -2])];
            tensor<int32, [4]> var_145 = const()[name = tensor<string, []>("op_145"), val = tensor<int32, [4]>([1, 512, 128, 128])];
            tensor<fp32, [1, 512, 16384]> transpose_6 = transpose(perm = var_144_perm_0, x = input_23)[name = tensor<string, []>("transpose_6")];
            tensor<fp32, [1, 512, 128, 128]> hidden_states_13 = reshape(shape = var_145, x = transpose_6)[name = tensor<string, []>("hidden_states_13")];
            tensor<fp32, [1, 512, 128, 128]> hidden_states_15 = add(x = hidden_states_13, y = var_82)[name = tensor<string, []>("hidden_states_15")];
            tensor<int32, [5]> reshape_12_shape_0 = const()[name = tensor<string, []>("reshape_12_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 128, 128])];
            tensor<fp32, [1, 32, 16, 128, 128]> reshape_12 = reshape(shape = reshape_12_shape_0, x = hidden_states_15)[name = tensor<string, []>("reshape_12")];
            tensor<int32, [3]> reduce_mean_9_axes_0 = const()[name = tensor<string, []>("reduce_mean_9_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_9_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_9_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 32, 1, 1, 1]> reduce_mean_9 = reduce_mean(axes = reduce_mean_9_axes_0, keep_dims = reduce_mean_9_keep_dims_0, x = reshape_12)[name = tensor<string, []>("reduce_mean_9")];
            tensor<fp32, [1, 32, 16, 128, 128]> sub_6 = sub(x = reshape_12, y = reduce_mean_9)[name = tensor<string, []>("sub_6")];
            tensor<fp32, [1, 32, 16, 128, 128]> square_3 = square(x = sub_6)[name = tensor<string, []>("square_3")];
            tensor<int32, [3]> reduce_mean_11_axes_0 = const()[name = tensor<string, []>("reduce_mean_11_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_11_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_11_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 32, 1, 1, 1]> reduce_mean_11 = reduce_mean(axes = reduce_mean_11_axes_0, keep_dims = reduce_mean_11_keep_dims_0, x = square_3)[name = tensor<string, []>("reduce_mean_11")];
            tensor<fp32, []> add_6_y_0 = const()[name = tensor<string, []>("add_6_y_0"), val = tensor<fp32, []>(0x1.0c6f7ap-20)];
            tensor<fp32, [1, 32, 1, 1, 1]> add_6 = add(x = reduce_mean_11, y = add_6_y_0)[name = tensor<string, []>("add_6")];
            tensor<fp32, [1, 32, 1, 1, 1]> sqrt_3 = sqrt(x = add_6)[name = tensor<string, []>("sqrt_3")];
            tensor<fp32, [1, 32, 16, 128, 128]> real_div_3 = real_div(x = sub_6, y = sqrt_3)[name = tensor<string, []>("real_div_3")];
            tensor<int32, [4]> reshape_13_shape_0 = const()[name = tensor<string, []>("reshape_13_shape_0"), val = tensor<int32, [4]>([1, 512, 128, 128])];
            tensor<fp32, [1, 512, 128, 128]> reshape_13 = reshape(shape = reshape_13_shape_0, x = real_div_3)[name = tensor<string, []>("reshape_13")];
            tensor<fp32, [512]> add_7_gamma_0 = const()[name = tensor<string, []>("add_7_gamma_0"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197890560)))];
            tensor<fp32, [512]> add_7_beta_0 = const()[name = tensor<string, []>("add_7_beta_0"), val = tensor<fp32, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(197892672)))];
            tensor<fp32, []> add_7_epsilon_0 = const()[name = tensor<string, []>("add_7_epsilon_0"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, [1, 512, 128, 128]> add_7 = batch_norm(beta = add_7_beta_0, epsilon = add_7_epsilon_0, gamma = add_7_gamma_0, mean = add_1_mean_0, variance = add_1_variance_0, x = reshape_13)[name = tensor<string, []>("add_7")];
            tensor<fp32, [1, 512, 128, 128]> input_29 = silu(x = add_7)[name = tensor<string, []>("input_29")];
            tensor<int32, [2]> var_160 = const()[name = tensor<string, []>("op_160"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_162 = const()[name = tensor<string, []>("op_162"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_31_pad_type_0 = const()[name = tensor<string, []>("input_31_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_31_pad_0 = const()[name = tensor<string, []>("input_31_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp32, [1, 512, 128, 128]> input_31 = conv(bias = decoder_mid_block_resnets_1_conv1_bias, dilations = var_162, groups = var_26, pad = input_31_pad_0, pad_type = input_31_pad_type_0, strides = var_160, weight = decoder_mid_block_resnets_1_conv1_weight, x = input_29)[name = tensor<string, []>("input_31")];
            tensor<int32, [5]> reshape_16_shape_0 = const()[name = tensor<string, []>("reshape_16_shape_0"), val = tensor<int32, [5]>([1, 32, 16, 128, 128])];
            tensor<fp32, [1, 32, 16, 128, 128]> reshape_16 = reshape(shape = reshape_16_shape_0, x = input_31)[name = tensor<string, []>("reshape_16")];
            tensor<int32, [3]> reduce_mean_12_axes_0 = const()[name = tensor<string, []>("reduce_mean_12_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_12_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_12_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 32, 1, 1, 1]> reduce_mean_12 = reduce_mean(axes = reduce_mean_12_axes_0, keep_dims = reduce_mean_12_keep_dims_0, x = reshape_16)[name = tensor<string, []>("reduce_mean_12")];
            tensor<fp32, [1, 32, 16, 128, 128]> sub_8 = sub(x = reshape_16, y = reduce_mean_12)[name = tensor<string, []>("sub_8")];
            tensor<fp32, [1, 32, 16, 128, 128]> square_4 = square(x = sub_8)[name = tensor<string, []>("square_4")];
            tensor<int32, [3]> reduce_mean_14_axes_0 = const()[name = tensor<string, []>("reduce_mean_14_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_14_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_14_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp32, [1, 32, 1, 1, 1]> reduce_mean_14 = reduce_mean(axes = reduce_mean_14_axes_0, keep_dims = reduce_mean_14_keep_dims_0, x = square_4)[name = tensor<string, []>("reduce_mean_14")];
            tensor<fp32, []> add_8_y_0 = const()[name = tensor<string, []>("add_8_y_0"), val = tensor<fp32, []>(0x1.0c6f7ap-20)];
            tensor<fp32, [1, 32, 1, 1, 1]> add_8 = add(x = reduce_mean_14, y = add_8_y_0)[name = tensor<string, []>("add_8")];
