program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.4"}, {"coremlc-version", "1839.0.0"}, {"coremltools-component-torch", "2.0.1+cu117"}, {"coremltools-version", "7.0b1"}})]
{
    func main<ios16>(tensor<fp32, [1, 77]> input_ids) {
            tensor<int32, []> var_5 = const()[name = tensor<string, []>("op_5"), val = tensor<int32, []>(-1)];
            tensor<bool, []> var_6 = const()[name = tensor<string, []>("op_6"), val = tensor<bool, []>(false)];
            tensor<string, []> cast_1_dtype_0 = const()[name = tensor<string, []>("cast_1_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, []> inputs_embeds_axis_0 = const()[name = tensor<string, []>("inputs_embeds_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> inputs_embeds_batch_dims_0 = const()[name = tensor<string, []>("inputs_embeds_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [49408, 1280]> text_encoder_text_model_embeddings_token_embedding_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_embeddings_token_embedding_weight_to_fp16"), val = tensor<fp16, [49408, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<int32, [1, 77]> cast_1322 = cast(dtype = cast_1_dtype_0, x = input_ids)[name = tensor<string, []>("cast_1322")];
            tensor<fp16, [1, 77, 1280]> inputs_embeds_cast = gather(axis = inputs_embeds_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = cast_1322, x = text_encoder_text_model_embeddings_token_embedding_weight_to_fp16)[name = tensor<string, []>("inputs_embeds_cast")];
            tensor<fp16, [1, 77, 1280]> position_embeddings_to_fp16 = const()[name = tensor<string, []>("position_embeddings_to_fp16"), val = tensor<fp16, [1, 77, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126484608)))];
            tensor<fp16, [1, 77, 1280]> input_3_cast = add(x = inputs_embeds_cast, y = position_embeddings_to_fp16)[name = tensor<string, []>("input_3_cast")];
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126681792)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126684416)))];
            tensor<fp16, []> var_12_to_fp16 = const()[name = tensor<string, []>("op_12_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 77, 1280]> hidden_states_1_cast = layer_norm(axes = hidden_states_1_axes_0, beta = text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16, x = input_3_cast)[name = tensor<string, []>("hidden_states_1_cast")];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126687040)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(129963904)))];
            tensor<fp16, [1, 77, 1280]> var_128_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16, x = hidden_states_1_cast)[name = tensor<string, []>("op_128_cast")];
            tensor<fp16, []> var_129_to_fp16 = const()[name = tensor<string, []>("op_129_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 1280]> tensor_5_cast = mul(x = var_128_cast, y = var_129_to_fp16)[name = tensor<string, []>("tensor_5_cast")];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(129966528)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(133243392)))];
            tensor<fp16, [1, 77, 1280]> tensor_1_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16, x = hidden_states_1_cast)[name = tensor<string, []>("tensor_1_cast")];
            tensor<int32, [4]> var_134 = const()[name = tensor<string, []>("op_134"), val = tensor<int32, [4]>([1, -1, 20, 64])];
            tensor<fp16, [1, 77, 20, 64]> var_135_cast = reshape(shape = var_134, x = tensor_1_cast)[name = tensor<string, []>("op_135_cast")];
            tensor<int32, [4]> var_136_perm_0 = const()[name = tensor<string, []>("op_136_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(133246016)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136522880)))];
            tensor<fp16, [1, 77, 1280]> tensor_3_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16, x = hidden_states_1_cast)[name = tensor<string, []>("tensor_3_cast")];
            tensor<int32, [4]> var_141 = const()[name = tensor<string, []>("op_141"), val = tensor<int32, [4]>([1, -1, 20, 64])];
            tensor<fp16, [1, 77, 20, 64]> var_142_cast = reshape(shape = var_141, x = tensor_3_cast)[name = tensor<string, []>("op_142_cast")];
            tensor<int32, [4]> var_143_perm_0 = const()[name = tensor<string, []>("op_143_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_150 = const()[name = tensor<string, []>("op_150"), val = tensor<int32, [4]>([1, 77, 20, 64])];
            tensor<fp16, [1, 77, 20, 64]> var_151_cast = reshape(shape = var_150, x = tensor_5_cast)[name = tensor<string, []>("op_151_cast")];
            tensor<int32, [4]> var_152_perm_0 = const()[name = tensor<string, []>("op_152_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_154 = const()[name = tensor<string, []>("op_154"), val = tensor<int32, [3]>([20, -1, 64])];
            tensor<fp16, [1, 20, 77, 64]> transpose_158 = transpose(perm = var_152_perm_0, x = var_151_cast)[name = tensor<string, []>("transpose_158")];
            tensor<fp16, [20, 77, 64]> query_states_1_cast = reshape(shape = var_154, x = transpose_158)[name = tensor<string, []>("query_states_1_cast")];
            tensor<int32, [3]> var_156 = const()[name = tensor<string, []>("op_156"), val = tensor<int32, [3]>([20, -1, 64])];
            tensor<fp16, [1, 20, 77, 64]> transpose_160 = transpose(perm = var_136_perm_0, x = var_135_cast)[name = tensor<string, []>("transpose_160")];
            tensor<fp16, [20, 77, 64]> key_states_3_cast = reshape(shape = var_156, x = transpose_160)[name = tensor<string, []>("key_states_3_cast")];
            tensor<int32, [3]> var_158 = const()[name = tensor<string, []>("op_158"), val = tensor<int32, [3]>([20, -1, 64])];
            tensor<fp16, [1, 20, 77, 64]> transpose_159 = transpose(perm = var_143_perm_0, x = var_142_cast)[name = tensor<string, []>("transpose_159")];
            tensor<fp16, [20, 77, 64]> value_states_3_cast = reshape(shape = var_158, x = transpose_159)[name = tensor<string, []>("value_states_3_cast")];
            tensor<int32, [3]> var_161_perm_0 = const()[name = tensor<string, []>("op_161_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_1_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_1_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [20, 64, 77]> transpose_157 = transpose(perm = var_161_perm_0, x = key_states_3_cast)[name = tensor<string, []>("transpose_157")];
            tensor<fp16, [20, 77, 77]> attn_weights_1_cast = matmul(transpose_x = attn_weights_1_transpose_x_0, transpose_y = attn_weights_1_transpose_y_0, x = query_states_1_cast, y = transpose_157)[name = tensor<string, []>("attn_weights_1_cast")];
            tensor<int32, [4]> var_163 = const()[name = tensor<string, []>("op_163"), val = tensor<int32, [4]>([1, 20, 77, 77])];
            tensor<fp16, [1, 20, 77, 77]> var_164_cast = reshape(shape = var_163, x = attn_weights_1_cast)[name = tensor<string, []>("op_164_cast")];
            tensor<fp16, [1, 1, 77, 77]> causal_attention_mask_to_fp16 = const()[name = tensor<string, []>("causal_attention_mask_to_fp16"), val = tensor<fp16, [1, 1, 77, 77]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136525504)))];
            tensor<fp16, [1, 20, 77, 77]> attn_weights_3_cast = add(x = var_164_cast, y = causal_attention_mask_to_fp16)[name = tensor<string, []>("attn_weights_3_cast")];
            tensor<int32, [3]> var_169 = const()[name = tensor<string, []>("op_169"), val = tensor<int32, [3]>([20, 77, 77])];
            tensor<fp16, [20, 77, 77]> input_5_cast = reshape(shape = var_169, x = attn_weights_3_cast)[name = tensor<string, []>("input_5_cast")];
            tensor<fp16, [20, 77, 77]> input_7_cast = softmax(axis = var_5, x = input_5_cast)[name = tensor<string, []>("input_7_cast")];
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [20, 77, 64]> attn_output_1_cast = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = input_7_cast, y = value_states_3_cast)[name = tensor<string, []>("attn_output_1_cast")];
            tensor<int32, [4]> var_174 = const()[name = tensor<string, []>("op_174"), val = tensor<int32, [4]>([1, 20, 77, 64])];
            tensor<fp16, [1, 20, 77, 64]> attn_output_3_cast = reshape(shape = var_174, x = attn_output_1_cast)[name = tensor<string, []>("attn_output_3_cast")];
            tensor<int32, [4]> attn_output_5_perm_0 = const()[name = tensor<string, []>("attn_output_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_177 = const()[name = tensor<string, []>("op_177"), val = tensor<int32, [3]>([1, 77, 1280])];
            tensor<fp16, [1, 77, 20, 64]> transpose_156 = transpose(perm = attn_output_5_perm_0, x = attn_output_3_cast)[name = tensor<string, []>("transpose_156")];
            tensor<fp16, [1, 77, 1280]> input_9_cast = reshape(shape = var_177, x = transpose_156)[name = tensor<string, []>("input_9_cast")];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(136537472)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139814336)))];
            tensor<fp16, [1, 77, 1280]> hidden_states_3_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16, x = input_9_cast)[name = tensor<string, []>("hidden_states_3_cast")];
            tensor<fp16, [1, 77, 1280]> input_11_cast = add(x = input_3_cast, y = hidden_states_3_cast)[name = tensor<string, []>("input_11_cast")];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139816960)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139819584)))];
            tensor<fp16, [1, 77, 1280]> input_13_cast = layer_norm(axes = input_13_axes_0, beta = text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16, x = input_11_cast)[name = tensor<string, []>("input_13_cast")];
            tensor<fp16, [5120, 1280]> text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [5120, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(139822208)))];
            tensor<fp16, [5120]> text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(152929472)))];
            tensor<fp16, [1, 77, 5120]> input_15_cast = linear(bias = text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16, x = input_13_cast)[name = tensor<string, []>("input_15_cast")];
            tensor<string, []> input_17_mode_0 = const()[name = tensor<string, []>("input_17_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 77, 5120]> input_17_cast = gelu(mode = input_17_mode_0, x = input_15_cast)[name = tensor<string, []>("input_17_cast")];
            tensor<fp16, [1280, 5120]> text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [1280, 5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(152939776)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(166047040)))];
            tensor<fp16, [1, 77, 1280]> hidden_states_5_cast = linear(bias = text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16, x = input_17_cast)[name = tensor<string, []>("hidden_states_5_cast")];
            tensor<fp16, [1, 77, 1280]> input_19_cast = add(x = input_11_cast, y = hidden_states_5_cast)[name = tensor<string, []>("input_19_cast")];
            tensor<int32, [1]> hidden_states_7_axes_0 = const()[name = tensor<string, []>("hidden_states_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(166049664)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(166052288)))];
            tensor<fp16, [1, 77, 1280]> hidden_states_7_cast = layer_norm(axes = hidden_states_7_axes_0, beta = text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16, x = input_19_cast)[name = tensor<string, []>("hidden_states_7_cast")];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(166054912)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(169331776)))];
            tensor<fp16, [1, 77, 1280]> var_215_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16, x = hidden_states_7_cast)[name = tensor<string, []>("op_215_cast")];
            tensor<fp16, []> var_216_to_fp16 = const()[name = tensor<string, []>("op_216_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 1280]> tensor_11_cast = mul(x = var_215_cast, y = var_216_to_fp16)[name = tensor<string, []>("tensor_11_cast")];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(169334400)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(172611264)))];
            tensor<fp16, [1, 77, 1280]> tensor_7_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16, x = hidden_states_7_cast)[name = tensor<string, []>("tensor_7_cast")];
            tensor<int32, [4]> var_221 = const()[name = tensor<string, []>("op_221"), val = tensor<int32, [4]>([1, -1, 20, 64])];
            tensor<fp16, [1, 77, 20, 64]> var_222_cast = reshape(shape = var_221, x = tensor_7_cast)[name = tensor<string, []>("op_222_cast")];
            tensor<int32, [4]> var_223_perm_0 = const()[name = tensor<string, []>("op_223_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(172613888)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(175890752)))];
            tensor<fp16, [1, 77, 1280]> tensor_9_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16, x = hidden_states_7_cast)[name = tensor<string, []>("tensor_9_cast")];
            tensor<int32, [4]> var_228 = const()[name = tensor<string, []>("op_228"), val = tensor<int32, [4]>([1, -1, 20, 64])];
            tensor<fp16, [1, 77, 20, 64]> var_229_cast = reshape(shape = var_228, x = tensor_9_cast)[name = tensor<string, []>("op_229_cast")];
            tensor<int32, [4]> var_230_perm_0 = const()[name = tensor<string, []>("op_230_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_237 = const()[name = tensor<string, []>("op_237"), val = tensor<int32, [4]>([1, 77, 20, 64])];
            tensor<fp16, [1, 77, 20, 64]> var_238_cast = reshape(shape = var_237, x = tensor_11_cast)[name = tensor<string, []>("op_238_cast")];
            tensor<int32, [4]> var_239_perm_0 = const()[name = tensor<string, []>("op_239_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_241 = const()[name = tensor<string, []>("op_241"), val = tensor<int32, [3]>([20, -1, 64])];
            tensor<fp16, [1, 20, 77, 64]> transpose_153 = transpose(perm = var_239_perm_0, x = var_238_cast)[name = tensor<string, []>("transpose_153")];
            tensor<fp16, [20, 77, 64]> query_states_3_cast = reshape(shape = var_241, x = transpose_153)[name = tensor<string, []>("query_states_3_cast")];
            tensor<int32, [3]> var_243 = const()[name = tensor<string, []>("op_243"), val = tensor<int32, [3]>([20, -1, 64])];
            tensor<fp16, [1, 20, 77, 64]> transpose_155 = transpose(perm = var_223_perm_0, x = var_222_cast)[name = tensor<string, []>("transpose_155")];
            tensor<fp16, [20, 77, 64]> key_states_7_cast = reshape(shape = var_243, x = transpose_155)[name = tensor<string, []>("key_states_7_cast")];
            tensor<int32, [3]> var_245 = const()[name = tensor<string, []>("op_245"), val = tensor<int32, [3]>([20, -1, 64])];
            tensor<fp16, [1, 20, 77, 64]> transpose_154 = transpose(perm = var_230_perm_0, x = var_229_cast)[name = tensor<string, []>("transpose_154")];
            tensor<fp16, [20, 77, 64]> value_states_7_cast = reshape(shape = var_245, x = transpose_154)[name = tensor<string, []>("value_states_7_cast")];
            tensor<int32, [3]> var_248_perm_0 = const()[name = tensor<string, []>("op_248_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_7_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_7_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [20, 64, 77]> transpose_152 = transpose(perm = var_248_perm_0, x = key_states_7_cast)[name = tensor<string, []>("transpose_152")];
            tensor<fp16, [20, 77, 77]> attn_weights_7_cast = matmul(transpose_x = attn_weights_7_transpose_x_0, transpose_y = attn_weights_7_transpose_y_0, x = query_states_3_cast, y = transpose_152)[name = tensor<string, []>("attn_weights_7_cast")];
            tensor<int32, [4]> var_250 = const()[name = tensor<string, []>("op_250"), val = tensor<int32, [4]>([1, 20, 77, 77])];
            tensor<fp16, [1, 20, 77, 77]> var_251_cast = reshape(shape = var_250, x = attn_weights_7_cast)[name = tensor<string, []>("op_251_cast")];
            tensor<fp16, [1, 20, 77, 77]> attn_weights_9_cast = add(x = var_251_cast, y = causal_attention_mask_to_fp16)[name = tensor<string, []>("attn_weights_9_cast")];
            tensor<int32, [3]> var_256 = const()[name = tensor<string, []>("op_256"), val = tensor<int32, [3]>([20, 77, 77])];
            tensor<fp16, [20, 77, 77]> input_21_cast = reshape(shape = var_256, x = attn_weights_9_cast)[name = tensor<string, []>("input_21_cast")];
            tensor<fp16, [20, 77, 77]> input_23_cast = softmax(axis = var_5, x = input_21_cast)[name = tensor<string, []>("input_23_cast")];
            tensor<bool, []> attn_output_7_transpose_x_0 = const()[name = tensor<string, []>("attn_output_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_7_transpose_y_0 = const()[name = tensor<string, []>("attn_output_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [20, 77, 64]> attn_output_7_cast = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = input_23_cast, y = value_states_7_cast)[name = tensor<string, []>("attn_output_7_cast")];
            tensor<int32, [4]> var_261 = const()[name = tensor<string, []>("op_261"), val = tensor<int32, [4]>([1, 20, 77, 64])];
            tensor<fp16, [1, 20, 77, 64]> attn_output_9_cast = reshape(shape = var_261, x = attn_output_7_cast)[name = tensor<string, []>("attn_output_9_cast")];
            tensor<int32, [4]> attn_output_11_perm_0 = const()[name = tensor<string, []>("attn_output_11_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_264 = const()[name = tensor<string, []>("op_264"), val = tensor<int32, [3]>([1, 77, 1280])];
            tensor<fp16, [1, 77, 20, 64]> transpose_151 = transpose(perm = attn_output_11_perm_0, x = attn_output_9_cast)[name = tensor<string, []>("transpose_151")];
            tensor<fp16, [1, 77, 1280]> input_25_cast = reshape(shape = var_264, x = transpose_151)[name = tensor<string, []>("input_25_cast")];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(175893376)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(179170240)))];
            tensor<fp16, [1, 77, 1280]> hidden_states_9_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16, x = input_25_cast)[name = tensor<string, []>("hidden_states_9_cast")];
            tensor<fp16, [1, 77, 1280]> input_27_cast = add(x = input_19_cast, y = hidden_states_9_cast)[name = tensor<string, []>("input_27_cast")];
            tensor<int32, [1]> input_29_axes_0 = const()[name = tensor<string, []>("input_29_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(179172864)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(179175488)))];
            tensor<fp16, [1, 77, 1280]> input_29_cast = layer_norm(axes = input_29_axes_0, beta = text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16, x = input_27_cast)[name = tensor<string, []>("input_29_cast")];
            tensor<fp16, [5120, 1280]> text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [5120, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(179178112)))];
            tensor<fp16, [5120]> text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192285376)))];
            tensor<fp16, [1, 77, 5120]> input_31_cast = linear(bias = text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16, x = input_29_cast)[name = tensor<string, []>("input_31_cast")];
            tensor<string, []> input_33_mode_0 = const()[name = tensor<string, []>("input_33_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 77, 5120]> input_33_cast = gelu(mode = input_33_mode_0, x = input_31_cast)[name = tensor<string, []>("input_33_cast")];
            tensor<fp16, [1280, 5120]> text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [1280, 5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192295680)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(205402944)))];
            tensor<fp16, [1, 77, 1280]> hidden_states_11_cast = linear(bias = text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16, x = input_33_cast)[name = tensor<string, []>("hidden_states_11_cast")];
            tensor<fp16, [1, 77, 1280]> input_35_cast = add(x = input_27_cast, y = hidden_states_11_cast)[name = tensor<string, []>("input_35_cast")];
            tensor<int32, [1]> hidden_states_13_axes_0 = const()[name = tensor<string, []>("hidden_states_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(205405568)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(205408192)))];
            tensor<fp16, [1, 77, 1280]> hidden_states_13_cast = layer_norm(axes = hidden_states_13_axes_0, beta = text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16, x = input_35_cast)[name = tensor<string, []>("hidden_states_13_cast")];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(205410816)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(208687680)))];
            tensor<fp16, [1, 77, 1280]> var_302_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16, x = hidden_states_13_cast)[name = tensor<string, []>("op_302_cast")];
            tensor<fp16, []> var_303_to_fp16 = const()[name = tensor<string, []>("op_303_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 1280]> tensor_17_cast = mul(x = var_302_cast, y = var_303_to_fp16)[name = tensor<string, []>("tensor_17_cast")];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(208690304)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(211967168)))];
            tensor<fp16, [1, 77, 1280]> tensor_13_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16, x = hidden_states_13_cast)[name = tensor<string, []>("tensor_13_cast")];
            tensor<int32, [4]> var_308 = const()[name = tensor<string, []>("op_308"), val = tensor<int32, [4]>([1, -1, 20, 64])];
            tensor<fp16, [1, 77, 20, 64]> var_309_cast = reshape(shape = var_308, x = tensor_13_cast)[name = tensor<string, []>("op_309_cast")];
            tensor<int32, [4]> var_310_perm_0 = const()[name = tensor<string, []>("op_310_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(211969792)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(215246656)))];
            tensor<fp16, [1, 77, 1280]> tensor_15_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16, x = hidden_states_13_cast)[name = tensor<string, []>("tensor_15_cast")];
            tensor<int32, [4]> var_315 = const()[name = tensor<string, []>("op_315"), val = tensor<int32, [4]>([1, -1, 20, 64])];
            tensor<fp16, [1, 77, 20, 64]> var_316_cast = reshape(shape = var_315, x = tensor_15_cast)[name = tensor<string, []>("op_316_cast")];
            tensor<int32, [4]> var_317_perm_0 = const()[name = tensor<string, []>("op_317_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_324 = const()[name = tensor<string, []>("op_324"), val = tensor<int32, [4]>([1, 77, 20, 64])];
            tensor<fp16, [1, 77, 20, 64]> var_325_cast = reshape(shape = var_324, x = tensor_17_cast)[name = tensor<string, []>("op_325_cast")];
            tensor<int32, [4]> var_326_perm_0 = const()[name = tensor<string, []>("op_326_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_328 = const()[name = tensor<string, []>("op_328"), val = tensor<int32, [3]>([20, -1, 64])];
            tensor<fp16, [1, 20, 77, 64]> transpose_148 = transpose(perm = var_326_perm_0, x = var_325_cast)[name = tensor<string, []>("transpose_148")];
            tensor<fp16, [20, 77, 64]> query_states_5_cast = reshape(shape = var_328, x = transpose_148)[name = tensor<string, []>("query_states_5_cast")];
            tensor<int32, [3]> var_330 = const()[name = tensor<string, []>("op_330"), val = tensor<int32, [3]>([20, -1, 64])];
            tensor<fp16, [1, 20, 77, 64]> transpose_150 = transpose(perm = var_310_perm_0, x = var_309_cast)[name = tensor<string, []>("transpose_150")];
            tensor<fp16, [20, 77, 64]> key_states_11_cast = reshape(shape = var_330, x = transpose_150)[name = tensor<string, []>("key_states_11_cast")];
            tensor<int32, [3]> var_332 = const()[name = tensor<string, []>("op_332"), val = tensor<int32, [3]>([20, -1, 64])];
            tensor<fp16, [1, 20, 77, 64]> transpose_149 = transpose(perm = var_317_perm_0, x = var_316_cast)[name = tensor<string, []>("transpose_149")];
            tensor<fp16, [20, 77, 64]> value_states_11_cast = reshape(shape = var_332, x = transpose_149)[name = tensor<string, []>("value_states_11_cast")];
            tensor<int32, [3]> var_335_perm_0 = const()[name = tensor<string, []>("op_335_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_13_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_13_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [20, 64, 77]> transpose_147 = transpose(perm = var_335_perm_0, x = key_states_11_cast)[name = tensor<string, []>("transpose_147")];
            tensor<fp16, [20, 77, 77]> attn_weights_13_cast = matmul(transpose_x = attn_weights_13_transpose_x_0, transpose_y = attn_weights_13_transpose_y_0, x = query_states_5_cast, y = transpose_147)[name = tensor<string, []>("attn_weights_13_cast")];
            tensor<int32, [4]> var_337 = const()[name = tensor<string, []>("op_337"), val = tensor<int32, [4]>([1, 20, 77, 77])];
            tensor<fp16, [1, 20, 77, 77]> var_338_cast = reshape(shape = var_337, x = attn_weights_13_cast)[name = tensor<string, []>("op_338_cast")];
            tensor<fp16, [1, 20, 77, 77]> attn_weights_15_cast = add(x = var_338_cast, y = causal_attention_mask_to_fp16)[name = tensor<string, []>("attn_weights_15_cast")];
            tensor<int32, [3]> var_343 = const()[name = tensor<string, []>("op_343"), val = tensor<int32, [3]>([20, 77, 77])];
            tensor<fp16, [20, 77, 77]> input_37_cast = reshape(shape = var_343, x = attn_weights_15_cast)[name = tensor<string, []>("input_37_cast")];
            tensor<fp16, [20, 77, 77]> input_39_cast = softmax(axis = var_5, x = input_37_cast)[name = tensor<string, []>("input_39_cast")];
            tensor<bool, []> attn_output_13_transpose_x_0 = const()[name = tensor<string, []>("attn_output_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_13_transpose_y_0 = const()[name = tensor<string, []>("attn_output_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [20, 77, 64]> attn_output_13_cast = matmul(transpose_x = attn_output_13_transpose_x_0, transpose_y = attn_output_13_transpose_y_0, x = input_39_cast, y = value_states_11_cast)[name = tensor<string, []>("attn_output_13_cast")];
            tensor<int32, [4]> var_348 = const()[name = tensor<string, []>("op_348"), val = tensor<int32, [4]>([1, 20, 77, 64])];
            tensor<fp16, [1, 20, 77, 64]> attn_output_15_cast = reshape(shape = var_348, x = attn_output_13_cast)[name = tensor<string, []>("attn_output_15_cast")];
            tensor<int32, [4]> attn_output_17_perm_0 = const()[name = tensor<string, []>("attn_output_17_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_351 = const()[name = tensor<string, []>("op_351"), val = tensor<int32, [3]>([1, 77, 1280])];
            tensor<fp16, [1, 77, 20, 64]> transpose_146 = transpose(perm = attn_output_17_perm_0, x = attn_output_15_cast)[name = tensor<string, []>("transpose_146")];
            tensor<fp16, [1, 77, 1280]> input_41_cast = reshape(shape = var_351, x = transpose_146)[name = tensor<string, []>("input_41_cast")];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(215249280)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(218526144)))];
            tensor<fp16, [1, 77, 1280]> hidden_states_15_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16, x = input_41_cast)[name = tensor<string, []>("hidden_states_15_cast")];
            tensor<fp16, [1, 77, 1280]> input_43_cast = add(x = input_35_cast, y = hidden_states_15_cast)[name = tensor<string, []>("input_43_cast")];
            tensor<int32, [1]> input_45_axes_0 = const()[name = tensor<string, []>("input_45_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(218528768)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(218531392)))];
            tensor<fp16, [1, 77, 1280]> input_45_cast = layer_norm(axes = input_45_axes_0, beta = text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16, x = input_43_cast)[name = tensor<string, []>("input_45_cast")];
            tensor<fp16, [5120, 1280]> text_encoder_text_model_encoder_layers_2_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [5120, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(218534016)))];
            tensor<fp16, [5120]> text_encoder_text_model_encoder_layers_2_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(231641280)))];
            tensor<fp16, [1, 77, 5120]> input_47_cast = linear(bias = text_encoder_text_model_encoder_layers_2_mlp_fc1_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_mlp_fc1_weight_to_fp16, x = input_45_cast)[name = tensor<string, []>("input_47_cast")];
            tensor<string, []> input_49_mode_0 = const()[name = tensor<string, []>("input_49_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 77, 5120]> input_49_cast = gelu(mode = input_49_mode_0, x = input_47_cast)[name = tensor<string, []>("input_49_cast")];
            tensor<fp16, [1280, 5120]> text_encoder_text_model_encoder_layers_2_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [1280, 5120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(231651584)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_2_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(244758848)))];
            tensor<fp16, [1, 77, 1280]> hidden_states_17_cast = linear(bias = text_encoder_text_model_encoder_layers_2_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_mlp_fc2_weight_to_fp16, x = input_49_cast)[name = tensor<string, []>("hidden_states_17_cast")];
            tensor<fp16, [1, 77, 1280]> input_51_cast = add(x = input_43_cast, y = hidden_states_17_cast)[name = tensor<string, []>("input_51_cast")];
            tensor<int32, [1]> hidden_states_19_axes_0 = const()[name = tensor<string, []>("hidden_states_19_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_3_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(244761472)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_3_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(244764096)))];
            tensor<fp16, [1, 77, 1280]> hidden_states_19_cast = layer_norm(axes = hidden_states_19_axes_0, beta = text_encoder_text_model_encoder_layers_3_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_3_layer_norm1_weight_to_fp16, x = input_51_cast)[name = tensor<string, []>("hidden_states_19_cast")];
            tensor<fp16, [1280, 1280]> text_encoder_text_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [1280, 1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(244766720)))];
            tensor<fp16, [1280]> text_encoder_text_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(248043584)))];
            tensor<fp16, [1, 77, 1280]> var_389_cast = linear(bias = text_encoder_text_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16, x = hidden_states_19_cast)[name = tensor<string, []>("op_389_cast")];
            tensor<fp16, []> var_390_to_fp16 = const()[name = tensor<string, []>("op_390_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
