program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.4"}, {"coremlc-version", "1839.0.0"}, {"coremltools-component-torch", "2.0.1+cu117"}, {"coremltools-version", "7.0b1"}})]
{
    func main<ios16>(tensor<fp16, [2, 2048, 1, 77]> encoder_hidden_states, tensor<fp16, [2, 4, 128, 128]> sample, tensor<fp16, [2, 1280]> text_embeds, tensor<fp16, [12]> time_ids, tensor<fp16, [2]> timestep) {
            tensor<int32, []> var_24 = const()[name = tensor<string, []>("op_24"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_41_axes_0 = const()[name = tensor<string, []>("op_41_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1]> var_41_cast = expand_dims(axes = var_41_axes_0, x = timestep)[name = tensor<string, []>("op_41_cast")];
            tensor<fp16, [1, 160]> var_43_to_fp16 = const()[name = tensor<string, []>("op_43_to_fp16"), val = tensor<fp16, [1, 160]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [2, 160]> emb_3_cast = mul(x = var_41_cast, y = var_43_to_fp16)[name = tensor<string, []>("emb_3_cast")];
            tensor<fp16, [2, 160]> var_48_cast = sin(x = emb_3_cast)[name = tensor<string, []>("op_48_cast")];
            tensor<fp16, [2, 160]> var_49_cast = cos(x = emb_3_cast)[name = tensor<string, []>("op_49_cast")];
            tensor<bool, []> emb_7_interleave_0 = const()[name = tensor<string, []>("emb_7_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 320]> emb_7_cast = concat(axis = var_24, interleave = emb_7_interleave_0, values = (var_48_cast, var_49_cast))[name = tensor<string, []>("emb_7_cast")];
            tensor<int32, [2]> var_53_begin_0 = const()[name = tensor<string, []>("op_53_begin_0"), val = tensor<int32, [2]>([0, 160])];
            tensor<int32, [2]> var_53_end_0 = const()[name = tensor<string, []>("op_53_end_0"), val = tensor<int32, [2]>([2, 320])];
            tensor<bool, [2]> var_53_end_mask_0 = const()[name = tensor<string, []>("op_53_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [2, 160]> var_53_cast = slice_by_index(begin = var_53_begin_0, end = var_53_end_0, end_mask = var_53_end_mask_0, x = emb_7_cast)[name = tensor<string, []>("op_53_cast")];
            tensor<int32, [2]> var_55_begin_0 = const()[name = tensor<string, []>("op_55_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [2]> var_55_end_0 = const()[name = tensor<string, []>("op_55_end_0"), val = tensor<int32, [2]>([2, 160])];
            tensor<bool, [2]> var_55_end_mask_0 = const()[name = tensor<string, []>("op_55_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [2, 160]> var_55_cast = slice_by_index(begin = var_55_begin_0, end = var_55_end_0, end_mask = var_55_end_mask_0, x = emb_7_cast)[name = tensor<string, []>("op_55_cast")];
            tensor<bool, []> sample_3_interleave_0 = const()[name = tensor<string, []>("sample_3_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 320]> sample_3_cast = concat(axis = var_24, interleave = sample_3_interleave_0, values = (var_53_cast, var_55_cast))[name = tensor<string, []>("sample_3_cast")];
            tensor<int32, []> var_58 = const()[name = tensor<string, []>("op_58"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_65_axes_0 = const()[name = tensor<string, []>("op_65_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 320, 1]> var_65_cast = expand_dims(axes = var_65_axes_0, x = sample_3_cast)[name = tensor<string, []>("op_65_cast")];
            tensor<int32, [1]> input_1_axes_0 = const()[name = tensor<string, []>("input_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 320, 1, 1]> input_1_cast = expand_dims(axes = input_1_axes_0, x = var_65_cast)[name = tensor<string, []>("input_1_cast")];
            tensor<int32, [2]> var_69 = const()[name = tensor<string, []>("op_69"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_71 = const()[name = tensor<string, []>("op_71"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 320, 1, 1]> time_embedding_linear_1_weight_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_1_weight_to_fp16"), val = tensor<fp16, [1280, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(448)))];
            tensor<fp16, [1280]> time_embedding_linear_1_bias_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_1_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(819712)))];
            tensor<fp16, [2, 1280, 1, 1]> input_3_cast = conv(bias = time_embedding_linear_1_bias_to_fp16, dilations = var_71, groups = var_58, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = var_69, weight = time_embedding_linear_1_weight_to_fp16, x = input_1_cast)[name = tensor<string, []>("input_3_cast")];
            tensor<fp16, [2, 1280, 1, 1]> input_5_cast = silu(x = input_3_cast)[name = tensor<string, []>("input_5_cast")];
            tensor<int32, [2]> var_77 = const()[name = tensor<string, []>("op_77"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_79 = const()[name = tensor<string, []>("op_79"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> emb_pad_type_0 = const()[name = tensor<string, []>("emb_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> emb_pad_0 = const()[name = tensor<string, []>("emb_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> time_embedding_linear_2_weight_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_2_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(822336)))];
            tensor<fp16, [1280]> time_embedding_linear_2_bias_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4099200)))];
            tensor<fp16, [2, 1280, 1, 1]> emb_cast = conv(bias = time_embedding_linear_2_bias_to_fp16, dilations = var_79, groups = var_58, pad = emb_pad_0, pad_type = emb_pad_type_0, strides = var_77, weight = time_embedding_linear_2_weight_to_fp16, x = input_5_cast)[name = tensor<string, []>("emb_cast")];
            tensor<int32, []> var_85 = const()[name = tensor<string, []>("op_85"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_102_axes_0 = const()[name = tensor<string, []>("op_102_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [12, 1]> var_102_cast = expand_dims(axes = var_102_axes_0, x = time_ids)[name = tensor<string, []>("op_102_cast")];
            tensor<fp16, [1, 128]> var_104_to_fp16 = const()[name = tensor<string, []>("op_104_to_fp16"), val = tensor<fp16, [1, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4101824)))];
            tensor<fp16, [12, 128]> emb_11_cast = mul(x = var_102_cast, y = var_104_to_fp16)[name = tensor<string, []>("emb_11_cast")];
            tensor<fp16, [12, 128]> var_109_cast = sin(x = emb_11_cast)[name = tensor<string, []>("op_109_cast")];
            tensor<fp16, [12, 128]> var_110_cast = cos(x = emb_11_cast)[name = tensor<string, []>("op_110_cast")];
            tensor<bool, []> emb_15_interleave_0 = const()[name = tensor<string, []>("emb_15_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 256]> emb_15_cast = concat(axis = var_85, interleave = emb_15_interleave_0, values = (var_109_cast, var_110_cast))[name = tensor<string, []>("emb_15_cast")];
            tensor<int32, [2]> var_114_begin_0 = const()[name = tensor<string, []>("op_114_begin_0"), val = tensor<int32, [2]>([0, 128])];
            tensor<int32, [2]> var_114_end_0 = const()[name = tensor<string, []>("op_114_end_0"), val = tensor<int32, [2]>([12, 256])];
            tensor<bool, [2]> var_114_end_mask_0 = const()[name = tensor<string, []>("op_114_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [12, 128]> var_114_cast = slice_by_index(begin = var_114_begin_0, end = var_114_end_0, end_mask = var_114_end_mask_0, x = emb_15_cast)[name = tensor<string, []>("op_114_cast")];
            tensor<int32, [2]> var_116_begin_0 = const()[name = tensor<string, []>("op_116_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [2]> var_116_end_0 = const()[name = tensor<string, []>("op_116_end_0"), val = tensor<int32, [2]>([12, 128])];
            tensor<bool, [2]> var_116_end_mask_0 = const()[name = tensor<string, []>("op_116_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [12, 128]> var_116_cast = slice_by_index(begin = var_116_begin_0, end = var_116_end_0, end_mask = var_116_end_mask_0, x = emb_15_cast)[name = tensor<string, []>("op_116_cast")];
            tensor<bool, []> time_embeds_1_interleave_0 = const()[name = tensor<string, []>("time_embeds_1_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [12, 256]> time_embeds_1_cast = concat(axis = var_85, interleave = time_embeds_1_interleave_0, values = (var_114_cast, var_116_cast))[name = tensor<string, []>("time_embeds_1_cast")];
            tensor<int32, [2]> var_124 = const()[name = tensor<string, []>("op_124"), val = tensor<int32, [2]>([2, -1])];
            tensor<fp16, [2, 1536]> time_embeds_cast = reshape(shape = var_124, x = time_embeds_1_cast)[name = tensor<string, []>("time_embeds_cast")];
            tensor<int32, []> var_127 = const()[name = tensor<string, []>("op_127"), val = tensor<int32, []>(-1)];
            tensor<bool, []> sample_interleave_0 = const()[name = tensor<string, []>("sample_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 2816]> sample_cast = concat(axis = var_127, interleave = sample_interleave_0, values = (text_embeds, time_embeds_cast))[name = tensor<string, []>("sample_cast")];
            tensor<int32, []> var_129 = const()[name = tensor<string, []>("op_129"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_136_axes_0 = const()[name = tensor<string, []>("op_136_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 2816, 1]> var_136_cast = expand_dims(axes = var_136_axes_0, x = sample_cast)[name = tensor<string, []>("op_136_cast")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 2816, 1, 1]> input_7_cast = expand_dims(axes = input_7_axes_0, x = var_136_cast)[name = tensor<string, []>("input_7_cast")];
            tensor<int32, [2]> var_140 = const()[name = tensor<string, []>("op_140"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_142 = const()[name = tensor<string, []>("op_142"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 2816, 1, 1]> add_embedding_linear_1_weight_to_fp16 = const()[name = tensor<string, []>("add_embedding_linear_1_weight_to_fp16"), val = tensor<fp16, [1280, 2816, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4102144)))];
            tensor<fp16, [1280]> add_embedding_linear_1_bias_to_fp16 = const()[name = tensor<string, []>("add_embedding_linear_1_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11311168)))];
            tensor<fp16, [2, 1280, 1, 1]> input_9_cast = conv(bias = add_embedding_linear_1_bias_to_fp16, dilations = var_142, groups = var_129, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_140, weight = add_embedding_linear_1_weight_to_fp16, x = input_7_cast)[name = tensor<string, []>("input_9_cast")];
            tensor<fp16, [2, 1280, 1, 1]> input_11_cast = silu(x = input_9_cast)[name = tensor<string, []>("input_11_cast")];
            tensor<int32, [2]> var_148 = const()[name = tensor<string, []>("op_148"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_150 = const()[name = tensor<string, []>("op_150"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> aug_emb_pad_type_0 = const()[name = tensor<string, []>("aug_emb_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> aug_emb_pad_0 = const()[name = tensor<string, []>("aug_emb_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> add_embedding_linear_2_weight_to_fp16 = const()[name = tensor<string, []>("add_embedding_linear_2_weight_to_fp16"), val = tensor<fp16, [1280, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11313792)))];
            tensor<fp16, [1280]> add_embedding_linear_2_bias_to_fp16 = const()[name = tensor<string, []>("add_embedding_linear_2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14590656)))];
            tensor<fp16, [2, 1280, 1, 1]> aug_emb_cast = conv(bias = add_embedding_linear_2_bias_to_fp16, dilations = var_150, groups = var_129, pad = aug_emb_pad_0, pad_type = aug_emb_pad_type_0, strides = var_148, weight = add_embedding_linear_2_weight_to_fp16, x = input_11_cast)[name = tensor<string, []>("aug_emb_cast")];
            tensor<fp16, [2, 1280, 1, 1]> input_19_cast = add(x = emb_cast, y = aug_emb_cast)[name = tensor<string, []>("input_19_cast")];
            tensor<int32, []> var_158 = const()[name = tensor<string, []>("op_158"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_161 = const()[name = tensor<string, []>("op_161"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_163 = const()[name = tensor<string, []>("op_163"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 4, 3, 3]> conv_in_weight_to_fp16 = const()[name = tensor<string, []>("conv_in_weight_to_fp16"), val = tensor<fp16, [320, 4, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14593280)))];
            tensor<fp16, [320]> conv_in_bias_to_fp16 = const()[name = tensor<string, []>("conv_in_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14616384)))];
            tensor<fp16, [2, 320, 128, 128]> input_13_cast = conv(bias = conv_in_bias_to_fp16, dilations = var_163, groups = var_158, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_161, weight = conv_in_weight_to_fp16, x = sample)[name = tensor<string, []>("input_13_cast")];
            tensor<int32, []> var_172 = const()[name = tensor<string, []>("op_172"), val = tensor<int32, []>(1)];
            tensor<int32, [5]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 128, 128])];
            tensor<fp16, [2, 32, 10, 128, 128]> reshape_0_cast = reshape(shape = reshape_0_shape_0, x = input_13_cast)[name = tensor<string, []>("reshape_0_cast")];
            tensor<int32, [3]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_0_cast = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0_cast)[name = tensor<string, []>("reduce_mean_0_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> sub_0_cast = sub(x = reshape_0_cast, y = reduce_mean_0_cast)[name = tensor<string, []>("sub_0_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> square_0_cast = square(x = sub_0_cast)[name = tensor<string, []>("square_0_cast")];
            tensor<int32, [3]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_2_cast = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0_cast)[name = tensor<string, []>("reduce_mean_2_cast")];
            tensor<fp16, []> add_0_y_0_to_fp16 = const()[name = tensor<string, []>("add_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_0_cast = add(x = reduce_mean_2_cast, y = add_0_y_0_to_fp16)[name = tensor<string, []>("add_0_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_0_cast = sqrt(x = add_0_cast)[name = tensor<string, []>("sqrt_0_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> real_div_0_cast = real_div(x = sub_0_cast, y = sqrt_0_cast)[name = tensor<string, []>("real_div_0_cast")];
            tensor<int32, [4]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [4]>([2, 320, 128, 128])];
            tensor<fp16, [2, 320, 128, 128]> reshape_1_cast = reshape(shape = reshape_1_shape_0, x = real_div_0_cast)[name = tensor<string, []>("reshape_1_cast")];
            tensor<fp16, [320]> add_1_mean_0_to_fp16 = const()[name = tensor<string, []>("add_1_mean_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14617088)))];
            tensor<fp16, [320]> add_1_variance_0_to_fp16 = const()[name = tensor<string, []>("add_1_variance_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14617792)))];
            tensor<fp16, [320]> add_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_1_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14618496)))];
            tensor<fp16, [320]> add_1_beta_0_to_fp16 = const()[name = tensor<string, []>("add_1_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14619200)))];
            tensor<fp16, []> add_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 128, 128]> add_1_cast = batch_norm(beta = add_1_beta_0_to_fp16, epsilon = add_1_epsilon_0_to_fp16, gamma = add_1_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_1_cast)[name = tensor<string, []>("add_1_cast")];
            tensor<fp16, [2, 320, 128, 128]> input_17_cast = silu(x = add_1_cast)[name = tensor<string, []>("input_17_cast")];
            tensor<int32, [2]> var_190 = const()[name = tensor<string, []>("op_190"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_192 = const()[name = tensor<string, []>("op_192"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_1_pad_type_0 = const()[name = tensor<string, []>("hidden_states_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_1_pad_0 = const()[name = tensor<string, []>("hidden_states_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 320, 3, 3]> down_blocks_0_resnets_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv1_weight_to_fp16"), val = tensor<fp16, [320, 320, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14619904)))];
            tensor<fp16, [320]> down_blocks_0_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16463168)))];
            tensor<fp16, [2, 320, 128, 128]> hidden_states_1_cast = conv(bias = down_blocks_0_resnets_0_conv1_bias_to_fp16, dilations = var_192, groups = var_172, pad = hidden_states_1_pad_0, pad_type = hidden_states_1_pad_type_0, strides = var_190, weight = down_blocks_0_resnets_0_conv1_weight_to_fp16, x = input_17_cast)[name = tensor<string, []>("hidden_states_1_cast")];
            tensor<fp16, [2, 1280, 1, 1]> input_21_cast = silu(x = input_19_cast)[name = tensor<string, []>("input_21_cast")];
            tensor<int32, [2]> var_198 = const()[name = tensor<string, []>("op_198"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_200 = const()[name = tensor<string, []>("op_200"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> temb_1_pad_type_0 = const()[name = tensor<string, []>("temb_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> temb_1_pad_0 = const()[name = tensor<string, []>("temb_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 1280, 1, 1]> down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16"), val = tensor<fp16, [320, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16463872)))];
            tensor<fp16, [320]> down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17283136)))];
            tensor<fp16, [2, 320, 1, 1]> temb_1_cast = conv(bias = down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16, dilations = var_200, groups = var_172, pad = temb_1_pad_0, pad_type = temb_1_pad_type_0, strides = var_198, weight = down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16, x = input_21_cast)[name = tensor<string, []>("temb_1_cast")];
            tensor<fp16, [2, 320, 128, 128]> input_23_cast = add(x = hidden_states_1_cast, y = temb_1_cast)[name = tensor<string, []>("input_23_cast")];
            tensor<int32, [5]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 128, 128])];
            tensor<fp16, [2, 32, 10, 128, 128]> reshape_4_cast = reshape(shape = reshape_4_shape_0, x = input_23_cast)[name = tensor<string, []>("reshape_4_cast")];
            tensor<int32, [3]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_3_cast = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_4_cast)[name = tensor<string, []>("reduce_mean_3_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> sub_2_cast = sub(x = reshape_4_cast, y = reduce_mean_3_cast)[name = tensor<string, []>("sub_2_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> square_1_cast = square(x = sub_2_cast)[name = tensor<string, []>("square_1_cast")];
            tensor<int32, [3]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_5_cast = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1_cast)[name = tensor<string, []>("reduce_mean_5_cast")];
            tensor<fp16, []> add_2_y_0_to_fp16 = const()[name = tensor<string, []>("add_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_2_cast = add(x = reduce_mean_5_cast, y = add_2_y_0_to_fp16)[name = tensor<string, []>("add_2_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_1_cast = sqrt(x = add_2_cast)[name = tensor<string, []>("sqrt_1_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> real_div_1_cast = real_div(x = sub_2_cast, y = sqrt_1_cast)[name = tensor<string, []>("real_div_1_cast")];
            tensor<int32, [4]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [4]>([2, 320, 128, 128])];
            tensor<fp16, [2, 320, 128, 128]> reshape_5_cast = reshape(shape = reshape_5_shape_0, x = real_div_1_cast)[name = tensor<string, []>("reshape_5_cast")];
            tensor<fp16, [320]> add_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_3_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17283840)))];
            tensor<fp16, [320]> add_3_beta_0_to_fp16 = const()[name = tensor<string, []>("add_3_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17284544)))];
            tensor<fp16, []> add_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 128, 128]> add_3_cast = batch_norm(beta = add_3_beta_0_to_fp16, epsilon = add_3_epsilon_0_to_fp16, gamma = add_3_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_5_cast)[name = tensor<string, []>("add_3_cast")];
            tensor<fp16, [2, 320, 128, 128]> input_27_cast = silu(x = add_3_cast)[name = tensor<string, []>("input_27_cast")];
            tensor<int32, [2]> var_210 = const()[name = tensor<string, []>("op_210"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_212 = const()[name = tensor<string, []>("op_212"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_3_pad_type_0 = const()[name = tensor<string, []>("hidden_states_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_3_pad_0 = const()[name = tensor<string, []>("hidden_states_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 320, 3, 3]> down_blocks_0_resnets_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv2_weight_to_fp16"), val = tensor<fp16, [320, 320, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17285248)))];
            tensor<fp16, [320]> down_blocks_0_resnets_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv2_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19128512)))];
            tensor<fp16, [2, 320, 128, 128]> hidden_states_3_cast = conv(bias = down_blocks_0_resnets_0_conv2_bias_to_fp16, dilations = var_212, groups = var_172, pad = hidden_states_3_pad_0, pad_type = hidden_states_3_pad_type_0, strides = var_210, weight = down_blocks_0_resnets_0_conv2_weight_to_fp16, x = input_27_cast)[name = tensor<string, []>("hidden_states_3_cast")];
            tensor<fp16, [2, 320, 128, 128]> input_29_cast = add(x = input_13_cast, y = hidden_states_3_cast)[name = tensor<string, []>("input_29_cast")];
            tensor<int32, [5]> reshape_8_shape_0 = const()[name = tensor<string, []>("reshape_8_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 128, 128])];
            tensor<fp16, [2, 32, 10, 128, 128]> reshape_8_cast = reshape(shape = reshape_8_shape_0, x = input_29_cast)[name = tensor<string, []>("reshape_8_cast")];
            tensor<int32, [3]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_6_cast = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_8_cast)[name = tensor<string, []>("reduce_mean_6_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> sub_4_cast = sub(x = reshape_8_cast, y = reduce_mean_6_cast)[name = tensor<string, []>("sub_4_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> square_2_cast = square(x = sub_4_cast)[name = tensor<string, []>("square_2_cast")];
            tensor<int32, [3]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_8_cast = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2_cast)[name = tensor<string, []>("reduce_mean_8_cast")];
            tensor<fp16, []> add_4_y_0_to_fp16 = const()[name = tensor<string, []>("add_4_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_4_cast = add(x = reduce_mean_8_cast, y = add_4_y_0_to_fp16)[name = tensor<string, []>("add_4_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_2_cast = sqrt(x = add_4_cast)[name = tensor<string, []>("sqrt_2_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> real_div_2_cast = real_div(x = sub_4_cast, y = sqrt_2_cast)[name = tensor<string, []>("real_div_2_cast")];
            tensor<int32, [4]> reshape_9_shape_0 = const()[name = tensor<string, []>("reshape_9_shape_0"), val = tensor<int32, [4]>([2, 320, 128, 128])];
            tensor<fp16, [2, 320, 128, 128]> reshape_9_cast = reshape(shape = reshape_9_shape_0, x = real_div_2_cast)[name = tensor<string, []>("reshape_9_cast")];
            tensor<fp16, [320]> add_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_5_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19129216)))];
            tensor<fp16, [320]> add_5_beta_0_to_fp16 = const()[name = tensor<string, []>("add_5_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19129920)))];
            tensor<fp16, []> add_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 128, 128]> add_5_cast = batch_norm(beta = add_5_beta_0_to_fp16, epsilon = add_5_epsilon_0_to_fp16, gamma = add_5_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_9_cast)[name = tensor<string, []>("add_5_cast")];
            tensor<fp16, [2, 320, 128, 128]> input_33_cast = silu(x = add_5_cast)[name = tensor<string, []>("input_33_cast")];
            tensor<int32, [2]> var_227 = const()[name = tensor<string, []>("op_227"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_229 = const()[name = tensor<string, []>("op_229"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_5_pad_type_0 = const()[name = tensor<string, []>("hidden_states_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_5_pad_0 = const()[name = tensor<string, []>("hidden_states_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 320, 3, 3]> down_blocks_0_resnets_1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_conv1_weight_to_fp16"), val = tensor<fp16, [320, 320, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19130624)))];
            tensor<fp16, [320]> down_blocks_0_resnets_1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_conv1_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20973888)))];
            tensor<fp16, [2, 320, 128, 128]> hidden_states_5_cast = conv(bias = down_blocks_0_resnets_1_conv1_bias_to_fp16, dilations = var_229, groups = var_172, pad = hidden_states_5_pad_0, pad_type = hidden_states_5_pad_type_0, strides = var_227, weight = down_blocks_0_resnets_1_conv1_weight_to_fp16, x = input_33_cast)[name = tensor<string, []>("hidden_states_5_cast")];
            tensor<int32, [2]> var_235 = const()[name = tensor<string, []>("op_235"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_237 = const()[name = tensor<string, []>("op_237"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> temb_3_pad_type_0 = const()[name = tensor<string, []>("temb_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> temb_3_pad_0 = const()[name = tensor<string, []>("temb_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 1280, 1, 1]> down_blocks_0_resnets_1_time_emb_proj_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_time_emb_proj_weight_to_fp16"), val = tensor<fp16, [320, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20974592)))];
            tensor<fp16, [320]> down_blocks_0_resnets_1_time_emb_proj_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_time_emb_proj_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21793856)))];
            tensor<fp16, [2, 320, 1, 1]> temb_3_cast = conv(bias = down_blocks_0_resnets_1_time_emb_proj_bias_to_fp16, dilations = var_237, groups = var_172, pad = temb_3_pad_0, pad_type = temb_3_pad_type_0, strides = var_235, weight = down_blocks_0_resnets_1_time_emb_proj_weight_to_fp16, x = input_21_cast)[name = tensor<string, []>("temb_3_cast")];
            tensor<fp16, [2, 320, 128, 128]> input_37_cast = add(x = hidden_states_5_cast, y = temb_3_cast)[name = tensor<string, []>("input_37_cast")];
            tensor<int32, [5]> reshape_12_shape_0 = const()[name = tensor<string, []>("reshape_12_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 128, 128])];
            tensor<fp16, [2, 32, 10, 128, 128]> reshape_12_cast = reshape(shape = reshape_12_shape_0, x = input_37_cast)[name = tensor<string, []>("reshape_12_cast")];
            tensor<int32, [3]> reduce_mean_9_axes_0 = const()[name = tensor<string, []>("reduce_mean_9_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_9_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_9_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_9_cast = reduce_mean(axes = reduce_mean_9_axes_0, keep_dims = reduce_mean_9_keep_dims_0, x = reshape_12_cast)[name = tensor<string, []>("reduce_mean_9_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> sub_6_cast = sub(x = reshape_12_cast, y = reduce_mean_9_cast)[name = tensor<string, []>("sub_6_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> square_3_cast = square(x = sub_6_cast)[name = tensor<string, []>("square_3_cast")];
            tensor<int32, [3]> reduce_mean_11_axes_0 = const()[name = tensor<string, []>("reduce_mean_11_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_11_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_11_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_11_cast = reduce_mean(axes = reduce_mean_11_axes_0, keep_dims = reduce_mean_11_keep_dims_0, x = square_3_cast)[name = tensor<string, []>("reduce_mean_11_cast")];
            tensor<fp16, []> add_6_y_0_to_fp16 = const()[name = tensor<string, []>("add_6_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_6_cast = add(x = reduce_mean_11_cast, y = add_6_y_0_to_fp16)[name = tensor<string, []>("add_6_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_3_cast = sqrt(x = add_6_cast)[name = tensor<string, []>("sqrt_3_cast")];
            tensor<fp16, [2, 32, 10, 128, 128]> real_div_3_cast = real_div(x = sub_6_cast, y = sqrt_3_cast)[name = tensor<string, []>("real_div_3_cast")];
            tensor<int32, [4]> reshape_13_shape_0 = const()[name = tensor<string, []>("reshape_13_shape_0"), val = tensor<int32, [4]>([2, 320, 128, 128])];
            tensor<fp16, [2, 320, 128, 128]> reshape_13_cast = reshape(shape = reshape_13_shape_0, x = real_div_3_cast)[name = tensor<string, []>("reshape_13_cast")];
            tensor<fp16, [320]> add_7_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_7_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21794560)))];
            tensor<fp16, [320]> add_7_beta_0_to_fp16 = const()[name = tensor<string, []>("add_7_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21795264)))];
            tensor<fp16, []> add_7_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_7_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 128, 128]> add_7_cast = batch_norm(beta = add_7_beta_0_to_fp16, epsilon = add_7_epsilon_0_to_fp16, gamma = add_7_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_13_cast)[name = tensor<string, []>("add_7_cast")];
            tensor<fp16, [2, 320, 128, 128]> input_41_cast = silu(x = add_7_cast)[name = tensor<string, []>("input_41_cast")];
            tensor<int32, [2]> var_247 = const()[name = tensor<string, []>("op_247"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_249 = const()[name = tensor<string, []>("op_249"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_7_pad_type_0 = const()[name = tensor<string, []>("hidden_states_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_7_pad_0 = const()[name = tensor<string, []>("hidden_states_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 320, 3, 3]> down_blocks_0_resnets_1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_conv2_weight_to_fp16"), val = tensor<fp16, [320, 320, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21795968)))];
            tensor<fp16, [320]> down_blocks_0_resnets_1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_conv2_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23639232)))];
            tensor<fp16, [2, 320, 128, 128]> hidden_states_7_cast = conv(bias = down_blocks_0_resnets_1_conv2_bias_to_fp16, dilations = var_249, groups = var_172, pad = hidden_states_7_pad_0, pad_type = hidden_states_7_pad_type_0, strides = var_247, weight = down_blocks_0_resnets_1_conv2_weight_to_fp16, x = input_41_cast)[name = tensor<string, []>("hidden_states_7_cast")];
            tensor<fp16, [2, 320, 128, 128]> input_43_cast = add(x = input_29_cast, y = hidden_states_7_cast)[name = tensor<string, []>("input_43_cast")];
            tensor<int32, [2]> var_256 = const()[name = tensor<string, []>("op_256"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_258 = const()[name = tensor<string, []>("op_258"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_45_pad_type_0 = const()[name = tensor<string, []>("input_45_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_45_pad_0 = const()[name = tensor<string, []>("input_45_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 320, 3, 3]> down_blocks_0_downsamplers_0_conv_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_downsamplers_0_conv_weight_to_fp16"), val = tensor<fp16, [320, 320, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(23639936)))];
            tensor<fp16, [320]> down_blocks_0_downsamplers_0_conv_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_downsamplers_0_conv_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25483200)))];
            tensor<fp16, [2, 320, 64, 64]> input_45_cast = conv(bias = down_blocks_0_downsamplers_0_conv_bias_to_fp16, dilations = var_258, groups = var_172, pad = input_45_pad_0, pad_type = input_45_pad_type_0, strides = var_256, weight = down_blocks_0_downsamplers_0_conv_weight_to_fp16, x = input_43_cast)[name = tensor<string, []>("input_45_cast")];
            tensor<int32, []> var_266 = const()[name = tensor<string, []>("op_266"), val = tensor<int32, []>(3)];
            tensor<bool, []> var_277 = const()[name = tensor<string, []>("op_277"), val = tensor<bool, []>(true)];
            tensor<int32, []> var_282 = const()[name = tensor<string, []>("op_282"), val = tensor<int32, []>(1)];
            tensor<int32, [5]> reshape_16_shape_0 = const()[name = tensor<string, []>("reshape_16_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 64, 64])];
            tensor<fp16, [2, 32, 10, 64, 64]> reshape_16_cast = reshape(shape = reshape_16_shape_0, x = input_45_cast)[name = tensor<string, []>("reshape_16_cast")];
            tensor<int32, [3]> reduce_mean_12_axes_0 = const()[name = tensor<string, []>("reduce_mean_12_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_12_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_12_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_12_cast = reduce_mean(axes = reduce_mean_12_axes_0, keep_dims = reduce_mean_12_keep_dims_0, x = reshape_16_cast)[name = tensor<string, []>("reduce_mean_12_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> sub_8_cast = sub(x = reshape_16_cast, y = reduce_mean_12_cast)[name = tensor<string, []>("sub_8_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> square_4_cast = square(x = sub_8_cast)[name = tensor<string, []>("square_4_cast")];
            tensor<int32, [3]> reduce_mean_14_axes_0 = const()[name = tensor<string, []>("reduce_mean_14_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_14_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_14_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_14_cast = reduce_mean(axes = reduce_mean_14_axes_0, keep_dims = reduce_mean_14_keep_dims_0, x = square_4_cast)[name = tensor<string, []>("reduce_mean_14_cast")];
            tensor<fp16, []> add_8_y_0_to_fp16 = const()[name = tensor<string, []>("add_8_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_8_cast = add(x = reduce_mean_14_cast, y = add_8_y_0_to_fp16)[name = tensor<string, []>("add_8_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_4_cast = sqrt(x = add_8_cast)[name = tensor<string, []>("sqrt_4_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> real_div_4_cast = real_div(x = sub_8_cast, y = sqrt_4_cast)[name = tensor<string, []>("real_div_4_cast")];
            tensor<int32, [4]> reshape_17_shape_0 = const()[name = tensor<string, []>("reshape_17_shape_0"), val = tensor<int32, [4]>([2, 320, 64, 64])];
            tensor<fp16, [2, 320, 64, 64]> reshape_17_cast = reshape(shape = reshape_17_shape_0, x = real_div_4_cast)[name = tensor<string, []>("reshape_17_cast")];
            tensor<fp16, [320]> add_9_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_9_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25483904)))];
            tensor<fp16, [320]> add_9_beta_0_to_fp16 = const()[name = tensor<string, []>("add_9_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25484608)))];
            tensor<fp16, []> add_9_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_9_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 64, 64]> add_9_cast = batch_norm(beta = add_9_beta_0_to_fp16, epsilon = add_9_epsilon_0_to_fp16, gamma = add_9_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_17_cast)[name = tensor<string, []>("add_9_cast")];
            tensor<fp16, [2, 320, 64, 64]> input_49_cast = silu(x = add_9_cast)[name = tensor<string, []>("input_49_cast")];
            tensor<int32, [2]> var_305 = const()[name = tensor<string, []>("op_305"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_307 = const()[name = tensor<string, []>("op_307"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_9_pad_type_0 = const()[name = tensor<string, []>("hidden_states_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_9_pad_0 = const()[name = tensor<string, []>("hidden_states_9_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [640, 320, 3, 3]> down_blocks_1_resnets_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_1_resnets_0_conv1_weight_to_fp16"), val = tensor<fp16, [640, 320, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25485312)))];
            tensor<fp16, [640]> down_blocks_1_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_1_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [640]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29171776)))];
            tensor<fp16, [2, 640, 64, 64]> hidden_states_9_cast = conv(bias = down_blocks_1_resnets_0_conv1_bias_to_fp16, dilations = var_307, groups = var_282, pad = hidden_states_9_pad_0, pad_type = hidden_states_9_pad_type_0, strides = var_305, weight = down_blocks_1_resnets_0_conv1_weight_to_fp16, x = input_49_cast)[name = tensor<string, []>("hidden_states_9_cast")];
            tensor<int32, [2]> var_313 = const()[name = tensor<string, []>("op_313"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_315 = const()[name = tensor<string, []>("op_315"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> temb_5_pad_type_0 = const()[name = tensor<string, []>("temb_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> temb_5_pad_0 = const()[name = tensor<string, []>("temb_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [640, 1280, 1, 1]> down_blocks_1_resnets_0_time_emb_proj_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_1_resnets_0_time_emb_proj_weight_to_fp16"), val = tensor<fp16, [640, 1280, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29173120)))];
            tensor<fp16, [640]> down_blocks_1_resnets_0_time_emb_proj_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_1_resnets_0_time_emb_proj_bias_to_fp16"), val = tensor<fp16, [640]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30811584)))];
            tensor<fp16, [2, 640, 1, 1]> temb_5_cast = conv(bias = down_blocks_1_resnets_0_time_emb_proj_bias_to_fp16, dilations = var_315, groups = var_282, pad = temb_5_pad_0, pad_type = temb_5_pad_type_0, strides = var_313, weight = down_blocks_1_resnets_0_time_emb_proj_weight_to_fp16, x = input_21_cast)[name = tensor<string, []>("temb_5_cast")];
            tensor<fp16, [2, 640, 64, 64]> input_53_cast = add(x = hidden_states_9_cast, y = temb_5_cast)[name = tensor<string, []>("input_53_cast")];
            tensor<int32, [5]> reshape_20_shape_0 = const()[name = tensor<string, []>("reshape_20_shape_0"), val = tensor<int32, [5]>([2, 32, 20, 64, 64])];
