program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.5"}, {"coremlc-version", "1877.40.3"}, {"coremltools-component-torch", "2.0.1"}, {"coremltools-version", "7.0"}})]
{
    func main<ios16>(tensor<fp16, [2, 1280, 1, 77]> encoder_hidden_states, tensor<fp16, [2, 4, 128, 128]> sample, tensor<fp16, [2, 1280]> text_embeds, tensor<fp16, [2, 5]> time_ids, tensor<fp16, [2]> timestep) {
            tensor<int32, []> var_28 = const()[name = tensor<string, []>("op_28"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_45_axes_0 = const()[name = tensor<string, []>("op_45_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1]> var_45_cast = expand_dims(axes = var_45_axes_0, x = timestep)[name = tensor<string, []>("op_45_cast")];
            tensor<fp16, [1, 192]> var_47_to_fp16 = const()[name = tensor<string, []>("op_47_to_fp16"), val = tensor<fp16, [1, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [2, 192]> emb_3_cast = mul(x = var_45_cast, y = var_47_to_fp16)[name = tensor<string, []>("emb_3_cast")];
            tensor<fp16, [2, 192]> var_52_cast = sin(x = emb_3_cast)[name = tensor<string, []>("op_52_cast")];
            tensor<fp16, [2, 192]> var_53_cast = cos(x = emb_3_cast)[name = tensor<string, []>("op_53_cast")];
            tensor<bool, []> emb_7_interleave_0 = const()[name = tensor<string, []>("emb_7_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 384]> emb_7_cast = concat(axis = var_28, interleave = emb_7_interleave_0, values = (var_52_cast, var_53_cast))[name = tensor<string, []>("emb_7_cast")];
            tensor<int32, [2]> var_57_begin_0 = const()[name = tensor<string, []>("op_57_begin_0"), val = tensor<int32, [2]>([0, 192])];
            tensor<int32, [2]> var_57_end_0 = const()[name = tensor<string, []>("op_57_end_0"), val = tensor<int32, [2]>([2, 384])];
            tensor<bool, [2]> var_57_end_mask_0 = const()[name = tensor<string, []>("op_57_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [2, 192]> var_57_cast = slice_by_index(begin = var_57_begin_0, end = var_57_end_0, end_mask = var_57_end_mask_0, x = emb_7_cast)[name = tensor<string, []>("op_57_cast")];
            tensor<int32, [2]> var_59_begin_0 = const()[name = tensor<string, []>("op_59_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [2]> var_59_end_0 = const()[name = tensor<string, []>("op_59_end_0"), val = tensor<int32, [2]>([2, 192])];
            tensor<bool, [2]> var_59_end_mask_0 = const()[name = tensor<string, []>("op_59_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [2, 192]> var_59_cast = slice_by_index(begin = var_59_begin_0, end = var_59_end_0, end_mask = var_59_end_mask_0, x = emb_7_cast)[name = tensor<string, []>("op_59_cast")];
            tensor<bool, []> sample_3_interleave_0 = const()[name = tensor<string, []>("sample_3_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 384]> sample_3_cast = concat(axis = var_28, interleave = sample_3_interleave_0, values = (var_57_cast, var_59_cast))[name = tensor<string, []>("sample_3_cast")];
            tensor<int32, []> var_62 = const()[name = tensor<string, []>("op_62"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_69_axes_0 = const()[name = tensor<string, []>("op_69_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 384, 1]> var_69_cast = expand_dims(axes = var_69_axes_0, x = sample_3_cast)[name = tensor<string, []>("op_69_cast")];
            tensor<int32, [1]> input_1_axes_0 = const()[name = tensor<string, []>("input_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 384, 1, 1]> input_1_cast = expand_dims(axes = input_1_axes_0, x = var_69_cast)[name = tensor<string, []>("input_1_cast")];
            tensor<int32, [2]> var_73 = const()[name = tensor<string, []>("op_73"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_75 = const()[name = tensor<string, []>("op_75"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1536, 384, 1, 1]> time_embedding_linear_1_weight_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_1_weight_to_fp16"), val = tensor<fp16, [1536, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(512)))];
            tensor<fp16, [1536]> time_embedding_linear_1_bias_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1180224)))];
            tensor<fp16, [2, 1536, 1, 1]> input_3_cast = conv(bias = time_embedding_linear_1_bias_to_fp16, dilations = var_75, groups = var_62, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = var_73, weight = time_embedding_linear_1_weight_to_fp16, x = input_1_cast)[name = tensor<string, []>("input_3_cast")];
            tensor<fp16, [2, 1536, 1, 1]> input_5_cast = silu(x = input_3_cast)[name = tensor<string, []>("input_5_cast")];
            tensor<int32, [2]> var_81 = const()[name = tensor<string, []>("op_81"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_83 = const()[name = tensor<string, []>("op_83"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> emb_pad_type_0 = const()[name = tensor<string, []>("emb_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> emb_pad_0 = const()[name = tensor<string, []>("emb_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1536, 1536, 1, 1]> time_embedding_linear_2_weight_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_2_weight_to_fp16"), val = tensor<fp16, [1536, 1536, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1183360)))];
            tensor<fp16, [1536]> time_embedding_linear_2_bias_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_2_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5902016)))];
            tensor<fp16, [2, 1536, 1, 1]> emb_cast = conv(bias = time_embedding_linear_2_bias_to_fp16, dilations = var_83, groups = var_62, pad = emb_pad_0, pad_type = emb_pad_type_0, strides = var_81, weight = time_embedding_linear_2_weight_to_fp16, x = input_5_cast)[name = tensor<string, []>("emb_cast")];
            tensor<int32, [1]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [1]>([10])];
            tensor<fp16, [10]> timesteps_cast = reshape(shape = concat_0, x = time_ids)[name = tensor<string, []>("timesteps_cast")];
            tensor<int32, []> var_89 = const()[name = tensor<string, []>("op_89"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_106_axes_0 = const()[name = tensor<string, []>("op_106_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [10, 1]> var_106_cast = expand_dims(axes = var_106_axes_0, x = timesteps_cast)[name = tensor<string, []>("op_106_cast")];
            tensor<fp16, [1, 128]> var_108_to_fp16 = const()[name = tensor<string, []>("op_108_to_fp16"), val = tensor<fp16, [1, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5905152)))];
            tensor<fp16, [10, 128]> emb_11_cast = mul(x = var_106_cast, y = var_108_to_fp16)[name = tensor<string, []>("emb_11_cast")];
            tensor<fp16, [10, 128]> var_113_cast = sin(x = emb_11_cast)[name = tensor<string, []>("op_113_cast")];
            tensor<fp16, [10, 128]> var_114_cast = cos(x = emb_11_cast)[name = tensor<string, []>("op_114_cast")];
            tensor<bool, []> emb_15_interleave_0 = const()[name = tensor<string, []>("emb_15_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [10, 256]> emb_15_cast = concat(axis = var_89, interleave = emb_15_interleave_0, values = (var_113_cast, var_114_cast))[name = tensor<string, []>("emb_15_cast")];
            tensor<int32, [2]> var_118_begin_0 = const()[name = tensor<string, []>("op_118_begin_0"), val = tensor<int32, [2]>([0, 128])];
            tensor<int32, [2]> var_118_end_0 = const()[name = tensor<string, []>("op_118_end_0"), val = tensor<int32, [2]>([10, 256])];
            tensor<bool, [2]> var_118_end_mask_0 = const()[name = tensor<string, []>("op_118_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [10, 128]> var_118_cast = slice_by_index(begin = var_118_begin_0, end = var_118_end_0, end_mask = var_118_end_mask_0, x = emb_15_cast)[name = tensor<string, []>("op_118_cast")];
            tensor<int32, [2]> var_120_begin_0 = const()[name = tensor<string, []>("op_120_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [2]> var_120_end_0 = const()[name = tensor<string, []>("op_120_end_0"), val = tensor<int32, [2]>([10, 128])];
            tensor<bool, [2]> var_120_end_mask_0 = const()[name = tensor<string, []>("op_120_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [10, 128]> var_120_cast = slice_by_index(begin = var_120_begin_0, end = var_120_end_0, end_mask = var_120_end_mask_0, x = emb_15_cast)[name = tensor<string, []>("op_120_cast")];
            tensor<bool, []> time_embeds_1_interleave_0 = const()[name = tensor<string, []>("time_embeds_1_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [10, 256]> time_embeds_1_cast = concat(axis = var_89, interleave = time_embeds_1_interleave_0, values = (var_118_cast, var_120_cast))[name = tensor<string, []>("time_embeds_1_cast")];
            tensor<int32, [2]> var_128 = const()[name = tensor<string, []>("op_128"), val = tensor<int32, [2]>([2, -1])];
            tensor<fp16, [2, 1280]> time_embeds_cast = reshape(shape = var_128, x = time_embeds_1_cast)[name = tensor<string, []>("time_embeds_cast")];
            tensor<int32, []> var_131 = const()[name = tensor<string, []>("op_131"), val = tensor<int32, []>(-1)];
            tensor<bool, []> sample_interleave_0 = const()[name = tensor<string, []>("sample_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 2560]> sample_cast = concat(axis = var_131, interleave = sample_interleave_0, values = (text_embeds, time_embeds_cast))[name = tensor<string, []>("sample_cast")];
            tensor<int32, []> var_133 = const()[name = tensor<string, []>("op_133"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_140_axes_0 = const()[name = tensor<string, []>("op_140_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 2560, 1]> var_140_cast = expand_dims(axes = var_140_axes_0, x = sample_cast)[name = tensor<string, []>("op_140_cast")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 2560, 1, 1]> input_7_cast = expand_dims(axes = input_7_axes_0, x = var_140_cast)[name = tensor<string, []>("input_7_cast")];
            tensor<int32, [2]> var_144 = const()[name = tensor<string, []>("op_144"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_146 = const()[name = tensor<string, []>("op_146"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1536, 2560, 1, 1]> add_embedding_linear_1_weight_to_fp16 = const()[name = tensor<string, []>("add_embedding_linear_1_weight_to_fp16"), val = tensor<fp16, [1536, 2560, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5905472)))];
            tensor<fp16, [1536]> add_embedding_linear_1_bias_to_fp16 = const()[name = tensor<string, []>("add_embedding_linear_1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13769856)))];
            tensor<fp16, [2, 1536, 1, 1]> input_9_cast = conv(bias = add_embedding_linear_1_bias_to_fp16, dilations = var_146, groups = var_133, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_144, weight = add_embedding_linear_1_weight_to_fp16, x = input_7_cast)[name = tensor<string, []>("input_9_cast")];
            tensor<fp16, [2, 1536, 1, 1]> input_11_cast = silu(x = input_9_cast)[name = tensor<string, []>("input_11_cast")];
            tensor<int32, [2]> var_152 = const()[name = tensor<string, []>("op_152"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_154 = const()[name = tensor<string, []>("op_154"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> aug_emb_pad_type_0 = const()[name = tensor<string, []>("aug_emb_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> aug_emb_pad_0 = const()[name = tensor<string, []>("aug_emb_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1536, 1536, 1, 1]> add_embedding_linear_2_weight_to_fp16 = const()[name = tensor<string, []>("add_embedding_linear_2_weight_to_fp16"), val = tensor<fp16, [1536, 1536, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13772992)))];
            tensor<fp16, [1536]> add_embedding_linear_2_bias_to_fp16 = const()[name = tensor<string, []>("add_embedding_linear_2_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18491648)))];
            tensor<fp16, [2, 1536, 1, 1]> aug_emb_cast = conv(bias = add_embedding_linear_2_bias_to_fp16, dilations = var_154, groups = var_133, pad = aug_emb_pad_0, pad_type = aug_emb_pad_type_0, strides = var_152, weight = add_embedding_linear_2_weight_to_fp16, x = input_11_cast)[name = tensor<string, []>("aug_emb_cast")];
            tensor<fp16, [2, 1536, 1, 1]> input_19_cast = add(x = emb_cast, y = aug_emb_cast)[name = tensor<string, []>("input_19_cast")];
            tensor<int32, []> var_162 = const()[name = tensor<string, []>("op_162"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_165 = const()[name = tensor<string, []>("op_165"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_167 = const()[name = tensor<string, []>("op_167"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [384, 4, 3, 3]> conv_in_weight_to_fp16 = const()[name = tensor<string, []>("conv_in_weight_to_fp16"), val = tensor<fp16, [384, 4, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18494784)))];
            tensor<fp16, [384]> conv_in_bias_to_fp16 = const()[name = tensor<string, []>("conv_in_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18522496)))];
            tensor<fp16, [2, 384, 128, 128]> input_13_cast = conv(bias = conv_in_bias_to_fp16, dilations = var_167, groups = var_162, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_165, weight = conv_in_weight_to_fp16, x = sample)[name = tensor<string, []>("input_13_cast")];
            tensor<int32, []> var_176 = const()[name = tensor<string, []>("op_176"), val = tensor<int32, []>(1)];
            tensor<int32, [5]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [5]>([2, 32, 12, 128, 128])];
            tensor<fp16, [2, 32, 12, 128, 128]> reshape_0_cast = reshape(shape = reshape_0_shape_0, x = input_13_cast)[name = tensor<string, []>("reshape_0_cast")];
            tensor<int32, [3]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_0_cast = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0_cast)[name = tensor<string, []>("reduce_mean_0_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> sub_0_cast = sub(x = reshape_0_cast, y = reduce_mean_0_cast)[name = tensor<string, []>("sub_0_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> square_0_cast = square(x = sub_0_cast)[name = tensor<string, []>("square_0_cast")];
            tensor<int32, [3]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_2_cast = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0_cast)[name = tensor<string, []>("reduce_mean_2_cast")];
            tensor<fp16, []> add_0_y_0_to_fp16 = const()[name = tensor<string, []>("add_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_0_cast = add(x = reduce_mean_2_cast, y = add_0_y_0_to_fp16)[name = tensor<string, []>("add_0_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_0_cast = sqrt(x = add_0_cast)[name = tensor<string, []>("sqrt_0_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> real_div_0_cast = real_div(x = sub_0_cast, y = sqrt_0_cast)[name = tensor<string, []>("real_div_0_cast")];
            tensor<int32, [4]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [4]>([2, 384, 128, 128])];
            tensor<fp16, [2, 384, 128, 128]> reshape_1_cast = reshape(shape = reshape_1_shape_0, x = real_div_0_cast)[name = tensor<string, []>("reshape_1_cast")];
            tensor<fp16, [384]> add_1_mean_0_to_fp16 = const()[name = tensor<string, []>("add_1_mean_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18523328)))];
            tensor<fp16, [384]> add_1_variance_0_to_fp16 = const()[name = tensor<string, []>("add_1_variance_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18524160)))];
            tensor<fp16, [384]> add_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_1_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18524992)))];
            tensor<fp16, [384]> add_1_beta_0_to_fp16 = const()[name = tensor<string, []>("add_1_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18525824)))];
            tensor<fp16, []> add_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 384, 128, 128]> add_1_cast = batch_norm(beta = add_1_beta_0_to_fp16, epsilon = add_1_epsilon_0_to_fp16, gamma = add_1_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_1_cast)[name = tensor<string, []>("add_1_cast")];
            tensor<fp16, [2, 384, 128, 128]> input_17_cast = silu(x = add_1_cast)[name = tensor<string, []>("input_17_cast")];
            tensor<int32, [2]> var_194 = const()[name = tensor<string, []>("op_194"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_196 = const()[name = tensor<string, []>("op_196"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_1_pad_type_0 = const()[name = tensor<string, []>("hidden_states_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_1_pad_0 = const()[name = tensor<string, []>("hidden_states_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [384, 384, 3, 3]> down_blocks_0_resnets_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv1_weight_to_fp16"), val = tensor<fp16, [384, 384, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18526656)))];
            tensor<fp16, [384]> down_blocks_0_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21180928)))];
            tensor<fp16, [2, 384, 128, 128]> hidden_states_1_cast = conv(bias = down_blocks_0_resnets_0_conv1_bias_to_fp16, dilations = var_196, groups = var_176, pad = hidden_states_1_pad_0, pad_type = hidden_states_1_pad_type_0, strides = var_194, weight = down_blocks_0_resnets_0_conv1_weight_to_fp16, x = input_17_cast)[name = tensor<string, []>("hidden_states_1_cast")];
            tensor<fp16, [2, 1536, 1, 1]> input_21_cast = silu(x = input_19_cast)[name = tensor<string, []>("input_21_cast")];
            tensor<int32, [2]> var_202 = const()[name = tensor<string, []>("op_202"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_204 = const()[name = tensor<string, []>("op_204"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> temb_1_pad_type_0 = const()[name = tensor<string, []>("temb_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> temb_1_pad_0 = const()[name = tensor<string, []>("temb_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 1536, 1, 1]> down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16"), val = tensor<fp16, [384, 1536, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21181760)))];
            tensor<fp16, [384]> down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22361472)))];
            tensor<fp16, [2, 384, 1, 1]> temb_1_cast = conv(bias = down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16, dilations = var_204, groups = var_176, pad = temb_1_pad_0, pad_type = temb_1_pad_type_0, strides = var_202, weight = down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16, x = input_21_cast)[name = tensor<string, []>("temb_1_cast")];
            tensor<fp16, [2, 384, 128, 128]> input_23_cast = add(x = hidden_states_1_cast, y = temb_1_cast)[name = tensor<string, []>("input_23_cast")];
            tensor<int32, [5]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [5]>([2, 32, 12, 128, 128])];
            tensor<fp16, [2, 32, 12, 128, 128]> reshape_4_cast = reshape(shape = reshape_4_shape_0, x = input_23_cast)[name = tensor<string, []>("reshape_4_cast")];
            tensor<int32, [3]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_3_cast = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_4_cast)[name = tensor<string, []>("reduce_mean_3_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> sub_2_cast = sub(x = reshape_4_cast, y = reduce_mean_3_cast)[name = tensor<string, []>("sub_2_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> square_1_cast = square(x = sub_2_cast)[name = tensor<string, []>("square_1_cast")];
            tensor<int32, [3]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_5_cast = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1_cast)[name = tensor<string, []>("reduce_mean_5_cast")];
            tensor<fp16, []> add_2_y_0_to_fp16 = const()[name = tensor<string, []>("add_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_2_cast = add(x = reduce_mean_5_cast, y = add_2_y_0_to_fp16)[name = tensor<string, []>("add_2_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_1_cast = sqrt(x = add_2_cast)[name = tensor<string, []>("sqrt_1_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> real_div_1_cast = real_div(x = sub_2_cast, y = sqrt_1_cast)[name = tensor<string, []>("real_div_1_cast")];
            tensor<int32, [4]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [4]>([2, 384, 128, 128])];
            tensor<fp16, [2, 384, 128, 128]> reshape_5_cast = reshape(shape = reshape_5_shape_0, x = real_div_1_cast)[name = tensor<string, []>("reshape_5_cast")];
            tensor<fp16, [384]> add_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_3_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22362304)))];
            tensor<fp16, [384]> add_3_beta_0_to_fp16 = const()[name = tensor<string, []>("add_3_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22363136)))];
            tensor<fp16, []> add_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 384, 128, 128]> add_3_cast = batch_norm(beta = add_3_beta_0_to_fp16, epsilon = add_3_epsilon_0_to_fp16, gamma = add_3_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_5_cast)[name = tensor<string, []>("add_3_cast")];
            tensor<fp16, [2, 384, 128, 128]> input_27_cast = silu(x = add_3_cast)[name = tensor<string, []>("input_27_cast")];
            tensor<int32, [2]> var_214 = const()[name = tensor<string, []>("op_214"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_216 = const()[name = tensor<string, []>("op_216"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_3_pad_type_0 = const()[name = tensor<string, []>("hidden_states_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_3_pad_0 = const()[name = tensor<string, []>("hidden_states_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [384, 384, 3, 3]> down_blocks_0_resnets_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv2_weight_to_fp16"), val = tensor<fp16, [384, 384, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22363968)))];
            tensor<fp16, [384]> down_blocks_0_resnets_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25018240)))];
            tensor<fp16, [2, 384, 128, 128]> hidden_states_3_cast = conv(bias = down_blocks_0_resnets_0_conv2_bias_to_fp16, dilations = var_216, groups = var_176, pad = hidden_states_3_pad_0, pad_type = hidden_states_3_pad_type_0, strides = var_214, weight = down_blocks_0_resnets_0_conv2_weight_to_fp16, x = input_27_cast)[name = tensor<string, []>("hidden_states_3_cast")];
            tensor<fp16, [2, 384, 128, 128]> input_29_cast = add(x = input_13_cast, y = hidden_states_3_cast)[name = tensor<string, []>("input_29_cast")];
            tensor<int32, [5]> reshape_8_shape_0 = const()[name = tensor<string, []>("reshape_8_shape_0"), val = tensor<int32, [5]>([2, 32, 12, 128, 128])];
            tensor<fp16, [2, 32, 12, 128, 128]> reshape_8_cast = reshape(shape = reshape_8_shape_0, x = input_29_cast)[name = tensor<string, []>("reshape_8_cast")];
            tensor<int32, [3]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_6_cast = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_8_cast)[name = tensor<string, []>("reduce_mean_6_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> sub_4_cast = sub(x = reshape_8_cast, y = reduce_mean_6_cast)[name = tensor<string, []>("sub_4_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> square_2_cast = square(x = sub_4_cast)[name = tensor<string, []>("square_2_cast")];
            tensor<int32, [3]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_8_cast = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2_cast)[name = tensor<string, []>("reduce_mean_8_cast")];
            tensor<fp16, []> add_4_y_0_to_fp16 = const()[name = tensor<string, []>("add_4_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_4_cast = add(x = reduce_mean_8_cast, y = add_4_y_0_to_fp16)[name = tensor<string, []>("add_4_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_2_cast = sqrt(x = add_4_cast)[name = tensor<string, []>("sqrt_2_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> real_div_2_cast = real_div(x = sub_4_cast, y = sqrt_2_cast)[name = tensor<string, []>("real_div_2_cast")];
            tensor<int32, [4]> reshape_9_shape_0 = const()[name = tensor<string, []>("reshape_9_shape_0"), val = tensor<int32, [4]>([2, 384, 128, 128])];
            tensor<fp16, [2, 384, 128, 128]> reshape_9_cast = reshape(shape = reshape_9_shape_0, x = real_div_2_cast)[name = tensor<string, []>("reshape_9_cast")];
            tensor<fp16, [384]> add_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_5_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25019072)))];
            tensor<fp16, [384]> add_5_beta_0_to_fp16 = const()[name = tensor<string, []>("add_5_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25019904)))];
            tensor<fp16, []> add_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 384, 128, 128]> add_5_cast = batch_norm(beta = add_5_beta_0_to_fp16, epsilon = add_5_epsilon_0_to_fp16, gamma = add_5_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_9_cast)[name = tensor<string, []>("add_5_cast")];
            tensor<fp16, [2, 384, 128, 128]> input_33_cast = silu(x = add_5_cast)[name = tensor<string, []>("input_33_cast")];
            tensor<int32, [2]> var_231 = const()[name = tensor<string, []>("op_231"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_233 = const()[name = tensor<string, []>("op_233"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_5_pad_type_0 = const()[name = tensor<string, []>("hidden_states_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_5_pad_0 = const()[name = tensor<string, []>("hidden_states_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [384, 384, 3, 3]> down_blocks_0_resnets_1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_conv1_weight_to_fp16"), val = tensor<fp16, [384, 384, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25020736)))];
            tensor<fp16, [384]> down_blocks_0_resnets_1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_conv1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27675008)))];
            tensor<fp16, [2, 384, 128, 128]> hidden_states_5_cast = conv(bias = down_blocks_0_resnets_1_conv1_bias_to_fp16, dilations = var_233, groups = var_176, pad = hidden_states_5_pad_0, pad_type = hidden_states_5_pad_type_0, strides = var_231, weight = down_blocks_0_resnets_1_conv1_weight_to_fp16, x = input_33_cast)[name = tensor<string, []>("hidden_states_5_cast")];
            tensor<int32, [2]> var_239 = const()[name = tensor<string, []>("op_239"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_241 = const()[name = tensor<string, []>("op_241"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> temb_3_pad_type_0 = const()[name = tensor<string, []>("temb_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> temb_3_pad_0 = const()[name = tensor<string, []>("temb_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 1536, 1, 1]> down_blocks_0_resnets_1_time_emb_proj_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_time_emb_proj_weight_to_fp16"), val = tensor<fp16, [384, 1536, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27675840)))];
            tensor<fp16, [384]> down_blocks_0_resnets_1_time_emb_proj_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_time_emb_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28855552)))];
            tensor<fp16, [2, 384, 1, 1]> temb_3_cast = conv(bias = down_blocks_0_resnets_1_time_emb_proj_bias_to_fp16, dilations = var_241, groups = var_176, pad = temb_3_pad_0, pad_type = temb_3_pad_type_0, strides = var_239, weight = down_blocks_0_resnets_1_time_emb_proj_weight_to_fp16, x = input_21_cast)[name = tensor<string, []>("temb_3_cast")];
            tensor<fp16, [2, 384, 128, 128]> input_37_cast = add(x = hidden_states_5_cast, y = temb_3_cast)[name = tensor<string, []>("input_37_cast")];
            tensor<int32, [5]> reshape_12_shape_0 = const()[name = tensor<string, []>("reshape_12_shape_0"), val = tensor<int32, [5]>([2, 32, 12, 128, 128])];
            tensor<fp16, [2, 32, 12, 128, 128]> reshape_12_cast = reshape(shape = reshape_12_shape_0, x = input_37_cast)[name = tensor<string, []>("reshape_12_cast")];
            tensor<int32, [3]> reduce_mean_9_axes_0 = const()[name = tensor<string, []>("reduce_mean_9_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_9_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_9_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_9_cast = reduce_mean(axes = reduce_mean_9_axes_0, keep_dims = reduce_mean_9_keep_dims_0, x = reshape_12_cast)[name = tensor<string, []>("reduce_mean_9_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> sub_6_cast = sub(x = reshape_12_cast, y = reduce_mean_9_cast)[name = tensor<string, []>("sub_6_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> square_3_cast = square(x = sub_6_cast)[name = tensor<string, []>("square_3_cast")];
            tensor<int32, [3]> reduce_mean_11_axes_0 = const()[name = tensor<string, []>("reduce_mean_11_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_11_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_11_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_11_cast = reduce_mean(axes = reduce_mean_11_axes_0, keep_dims = reduce_mean_11_keep_dims_0, x = square_3_cast)[name = tensor<string, []>("reduce_mean_11_cast")];
            tensor<fp16, []> add_6_y_0_to_fp16 = const()[name = tensor<string, []>("add_6_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_6_cast = add(x = reduce_mean_11_cast, y = add_6_y_0_to_fp16)[name = tensor<string, []>("add_6_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_3_cast = sqrt(x = add_6_cast)[name = tensor<string, []>("sqrt_3_cast")];
            tensor<fp16, [2, 32, 12, 128, 128]> real_div_3_cast = real_div(x = sub_6_cast, y = sqrt_3_cast)[name = tensor<string, []>("real_div_3_cast")];
            tensor<int32, [4]> reshape_13_shape_0 = const()[name = tensor<string, []>("reshape_13_shape_0"), val = tensor<int32, [4]>([2, 384, 128, 128])];
            tensor<fp16, [2, 384, 128, 128]> reshape_13_cast = reshape(shape = reshape_13_shape_0, x = real_div_3_cast)[name = tensor<string, []>("reshape_13_cast")];
            tensor<fp16, [384]> add_7_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_7_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28856384)))];
            tensor<fp16, [384]> add_7_beta_0_to_fp16 = const()[name = tensor<string, []>("add_7_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28857216)))];
            tensor<fp16, []> add_7_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_7_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 384, 128, 128]> add_7_cast = batch_norm(beta = add_7_beta_0_to_fp16, epsilon = add_7_epsilon_0_to_fp16, gamma = add_7_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_13_cast)[name = tensor<string, []>("add_7_cast")];
            tensor<fp16, [2, 384, 128, 128]> input_41_cast = silu(x = add_7_cast)[name = tensor<string, []>("input_41_cast")];
            tensor<int32, [2]> var_251 = const()[name = tensor<string, []>("op_251"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_253 = const()[name = tensor<string, []>("op_253"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_7_pad_type_0 = const()[name = tensor<string, []>("hidden_states_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_7_pad_0 = const()[name = tensor<string, []>("hidden_states_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [384, 384, 3, 3]> down_blocks_0_resnets_1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_conv2_weight_to_fp16"), val = tensor<fp16, [384, 384, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28858048)))];
            tensor<fp16, [384]> down_blocks_0_resnets_1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_1_conv2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31512320)))];
            tensor<fp16, [2, 384, 128, 128]> hidden_states_7_cast = conv(bias = down_blocks_0_resnets_1_conv2_bias_to_fp16, dilations = var_253, groups = var_176, pad = hidden_states_7_pad_0, pad_type = hidden_states_7_pad_type_0, strides = var_251, weight = down_blocks_0_resnets_1_conv2_weight_to_fp16, x = input_41_cast)[name = tensor<string, []>("hidden_states_7_cast")];
            tensor<fp16, [2, 384, 128, 128]> input_43_cast = add(x = input_29_cast, y = hidden_states_7_cast)[name = tensor<string, []>("input_43_cast")];
            tensor<int32, [2]> var_260 = const()[name = tensor<string, []>("op_260"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_262 = const()[name = tensor<string, []>("op_262"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_45_pad_type_0 = const()[name = tensor<string, []>("input_45_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_45_pad_0 = const()[name = tensor<string, []>("input_45_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [384, 384, 3, 3]> down_blocks_0_downsamplers_0_conv_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_downsamplers_0_conv_weight_to_fp16"), val = tensor<fp16, [384, 384, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31513152)))];
            tensor<fp16, [384]> down_blocks_0_downsamplers_0_conv_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_downsamplers_0_conv_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34167424)))];
            tensor<fp16, [2, 384, 64, 64]> input_45_cast = conv(bias = down_blocks_0_downsamplers_0_conv_bias_to_fp16, dilations = var_262, groups = var_176, pad = input_45_pad_0, pad_type = input_45_pad_type_0, strides = var_260, weight = down_blocks_0_downsamplers_0_conv_weight_to_fp16, x = input_43_cast)[name = tensor<string, []>("input_45_cast")];
            tensor<int32, []> var_270 = const()[name = tensor<string, []>("op_270"), val = tensor<int32, []>(3)];
            tensor<bool, []> var_281 = const()[name = tensor<string, []>("op_281"), val = tensor<bool, []>(true)];
            tensor<int32, []> var_286 = const()[name = tensor<string, []>("op_286"), val = tensor<int32, []>(1)];
            tensor<int32, [5]> reshape_16_shape_0 = const()[name = tensor<string, []>("reshape_16_shape_0"), val = tensor<int32, [5]>([2, 32, 12, 64, 64])];
            tensor<fp16, [2, 32, 12, 64, 64]> reshape_16_cast = reshape(shape = reshape_16_shape_0, x = input_45_cast)[name = tensor<string, []>("reshape_16_cast")];
            tensor<int32, [3]> reduce_mean_12_axes_0 = const()[name = tensor<string, []>("reduce_mean_12_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_12_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_12_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_12_cast = reduce_mean(axes = reduce_mean_12_axes_0, keep_dims = reduce_mean_12_keep_dims_0, x = reshape_16_cast)[name = tensor<string, []>("reduce_mean_12_cast")];
            tensor<fp16, [2, 32, 12, 64, 64]> sub_8_cast = sub(x = reshape_16_cast, y = reduce_mean_12_cast)[name = tensor<string, []>("sub_8_cast")];
            tensor<fp16, [2, 32, 12, 64, 64]> square_4_cast = square(x = sub_8_cast)[name = tensor<string, []>("square_4_cast")];
            tensor<int32, [3]> reduce_mean_14_axes_0 = const()[name = tensor<string, []>("reduce_mean_14_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_14_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_14_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_14_cast = reduce_mean(axes = reduce_mean_14_axes_0, keep_dims = reduce_mean_14_keep_dims_0, x = square_4_cast)[name = tensor<string, []>("reduce_mean_14_cast")];
            tensor<fp16, []> add_8_y_0_to_fp16 = const()[name = tensor<string, []>("add_8_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_8_cast = add(x = reduce_mean_14_cast, y = add_8_y_0_to_fp16)[name = tensor<string, []>("add_8_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_4_cast = sqrt(x = add_8_cast)[name = tensor<string, []>("sqrt_4_cast")];
            tensor<fp16, [2, 32, 12, 64, 64]> real_div_4_cast = real_div(x = sub_8_cast, y = sqrt_4_cast)[name = tensor<string, []>("real_div_4_cast")];
            tensor<int32, [4]> reshape_17_shape_0 = const()[name = tensor<string, []>("reshape_17_shape_0"), val = tensor<int32, [4]>([2, 384, 64, 64])];
            tensor<fp16, [2, 384, 64, 64]> reshape_17_cast = reshape(shape = reshape_17_shape_0, x = real_div_4_cast)[name = tensor<string, []>("reshape_17_cast")];
            tensor<fp16, [384]> add_9_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_9_gamma_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34168256)))];
            tensor<fp16, [384]> add_9_beta_0_to_fp16 = const()[name = tensor<string, []>("add_9_beta_0_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34169088)))];
            tensor<fp16, []> add_9_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_9_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 384, 64, 64]> add_9_cast = batch_norm(beta = add_9_beta_0_to_fp16, epsilon = add_9_epsilon_0_to_fp16, gamma = add_9_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_17_cast)[name = tensor<string, []>("add_9_cast")];
            tensor<fp16, [2, 384, 64, 64]> input_49_cast = silu(x = add_9_cast)[name = tensor<string, []>("input_49_cast")];
            tensor<int32, [2]> var_309 = const()[name = tensor<string, []>("op_309"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_311 = const()[name = tensor<string, []>("op_311"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_9_pad_type_0 = const()[name = tensor<string, []>("hidden_states_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_9_pad_0 = const()[name = tensor<string, []>("hidden_states_9_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [768, 384, 3, 3]> down_blocks_1_resnets_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_1_resnets_0_conv1_weight_to_fp16"), val = tensor<fp16, [768, 384, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34169920)))];
            tensor<fp16, [768]> down_blocks_1_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_1_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39478400)))];
            tensor<fp16, [2, 768, 64, 64]> hidden_states_9_cast = conv(bias = down_blocks_1_resnets_0_conv1_bias_to_fp16, dilations = var_311, groups = var_286, pad = hidden_states_9_pad_0, pad_type = hidden_states_9_pad_type_0, strides = var_309, weight = down_blocks_1_resnets_0_conv1_weight_to_fp16, x = input_49_cast)[name = tensor<string, []>("hidden_states_9_cast")];
            tensor<int32, [2]> var_317 = const()[name = tensor<string, []>("op_317"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_319 = const()[name = tensor<string, []>("op_319"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> temb_5_pad_type_0 = const()[name = tensor<string, []>("temb_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> temb_5_pad_0 = const()[name = tensor<string, []>("temb_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [768, 1536, 1, 1]> down_blocks_1_resnets_0_time_emb_proj_weight_to_fp16 = const()[name = tensor<string, []>("down_blocks_1_resnets_0_time_emb_proj_weight_to_fp16"), val = tensor<fp16, [768, 1536, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39480000)))];
            tensor<fp16, [768]> down_blocks_1_resnets_0_time_emb_proj_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_1_resnets_0_time_emb_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41839360)))];
            tensor<fp16, [2, 768, 1, 1]> temb_5_cast = conv(bias = down_blocks_1_resnets_0_time_emb_proj_bias_to_fp16, dilations = var_319, groups = var_286, pad = temb_5_pad_0, pad_type = temb_5_pad_type_0, strides = var_317, weight = down_blocks_1_resnets_0_time_emb_proj_weight_to_fp16, x = input_21_cast)[name = tensor<string, []>("temb_5_cast")];
            tensor<fp16, [2, 768, 64, 64]> input_53_cast = add(x = hidden_states_9_cast, y = temb_5_cast)[name = tensor<string, []>("input_53_cast")];
